[
  {
    "id": "22in-industrial-planer-7-5hp",
    "name": "22\" INDUSTRIAL PLANER 7.5HP",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this Planer and get a FREE in-depth Planer course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase. Click here for more info",
    "badge": ""
  },
  {
    "id": "25in-industrial-planer-15hp",
    "name": "25\" INDUSTRIAL PLANER 15HP",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this Planer and get a FREE in-depth Planer course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase. Click here for more info",
    "badge": ""
  },
  {
    "id": "busy-bee-deluxe-miter-gauge-system",
    "name": "BUSY BEE DELUXE MITER GAUGE SYSTEM",
    "imageUrl": "",
    "shortDescription": "The BB115 Deluxe Miter Gauge System is a high-precision tool crafted to deliver exceptional accuracy and control for woodworking projects. Designed for both professionals and hobbyists, this system offers precise angle adjustments and versatile features, allowing you to achieve flawless cuts every time. Its durable construction and user-friendly design make it an indispensable upgrade to your workshop, ensuring efficient and precise results.",
    "badge": ""
  },
  {
    "id": "8in-benchtop-jointer-with-helical-cutterh-cx08bthc",
    "name": "8\" BENCHTOP HELICAL HEAD JOINTER",
    "imageUrl": "",
    "shortDescription": "",
    "badge": ""
  },
  {
    "id": "portable-vertical-panel-saw-safety-speed",
    "name": "PORTABLE VERTICAL PANEL SAW SAFETY SPEED",
    "imageUrl": "",
    "shortDescription": "B4309 SAFETY SPEED PORTABLE VERTICAL PANEL SAW   The Safety Speed Portable Vertical Panel Saw is a compact panel saw with a 5’ frame, and a 50” maximum crosscut with a 96” rip cut capacity. Featuring a cut accuracy of 1/32″, and a 1.75″ cut depth.The Panel Saw replaces the Milwaukee Tool 6480-20 Panel Saw, a private label that Safety Speed Manufacturing made out of their Minnesota factory for Milwaukee Tool for the last 40 years. The Safety Speed Panel Saw includes a 3.25 horsepower Milwaukee Tool motor. The dust collection kit and vacuum for collecting as much dust as possible are optional accessories. This machine is only available within North America. Features  Wheels and a folding stand provide portability for your compact panel saw and allow you to move it around your shop as you see fit. Standard Equipment 3 ¼ Hp, 15 amp industrial, Milwaukee Tool motor. Folding Stand Wheels Zinc plated 1 ¾” steel guide tubes. 4 Nylatron roller bearing systems. Adjustable vertical and horizontal rulers. Quick change from vertical to horizontal cutting. Thin material pressure guard. Injection-molded plastic material rollers. Spring loaded counter balance system. Integrated dust collection bonnet. Extended warranty. TUV certified to UL/CSA standards  Specifications  Weight 189 lbs Dimensions 60 × 11 × 70 in Max. Crosscut 50\"/1270mm Max. Rip Cut 96\"/2450mm Cut Depth 1 ¾\"/45mm Cut Accuracy 1/32\"/.8mm Frame Length 60\"/ 525mm Saw Blade Diameter 8\"/210mm Saw Blade Bore Size 5/8\" Daily Usage 1-3 Hours Rollers 8 Motor volt and amperage 15 amp, 120V, 7.5 amps, 220V Motor Manufacturer Milwaukee Tool Machine Footprint 15sqft Machine Length 60\"/1525mm Machine Height 75\"/1900mm Machine Width with stand attached 36\"/915mm",
    "badge": ""
  },
  {
    "id": "2-5in-power-tool-hose-kit",
    "name": "POWER TOOL HOSE KIT WITH FITTINGS",
    "imageUrl": "",
    "shortDescription": "This 10-foot flexible hose kit is essential for workshops with multiple tools that have varying dust collection port sizes. It includes four different-sized adaptors, making it versatile enough to connect various machines to your vacuum or dust collection system. The hose is designed to be kink-proof, crush-resistant, strong, durable, and highly flexible, ensuring it can handle the demands of any busy shop. This kit is perfect for maintaining a clean and healthy work environment by keeping dust out of the air and off your equipment.",
    "badge": ""
  },
  {
    "id": "mobile-base-universal-450lbs-craftex",
    "name": "UNIVERSAL MOBILE BASE 450LBS CAPACITY",
    "imageUrl": "",
    "shortDescription": "CT183 Universal Mobile Base with 450 lbs Load Capacity - CRAFTEX  High quality and very versatile, this mobile base is the perfect addition to your workshop.  This mobile base can be adjusted to form:  Maximum Square: 34\" x 34\" Maximum Rectangle: 18\" x 50\" Minimum Size: 12\" x 12\"  FEATURES 3\" Heavy Duty Wheels Foot Operated Locking Cam Lift Two Rubber Levelling Feet Slotted Side Rails to Adjust from 12\" to 52\" 450 lbs Load Capacity",
    "badge": ""
  },
  {
    "id": "sander-1in-x30in-belt-and-5in-disc-csa-ct170n",
    "name": "1\" X 30\" BELT & DISC SANDER",
    "imageUrl": "",
    "shortDescription": "CT170N",
    "badge": ""
  },
  {
    "id": "heavy-duty-mobile-base-with-foot-pedals",
    "name": "HEAVY DUTY MOBILE BASE 700LBS CAPACITY",
    "imageUrl": "",
    "shortDescription": "This heavy duty mobile base is designed for a stable and mobile platform for machines and equipment's having a variety of base sizes and weights. The heavy duty 3\" diameter swivel wheels with ball bearings and the 4\" rear supporting wheels allow moving your machines around the shop with ease and provide great stability and maneuverability. This mobile base has a load capacity of 700 lbs and is a great addition to your shop.FEATURESMinimum Size: 14\" x 14\"Maximum Size: 20\" x 52\"Load Capacity: 700 lbs / 320 KgsHeavy Duty 3\" Diameter Swivel Wheels with Ball BearingsHeavy Duty 4\" Rear Supporting WheelsN.Weight: 9 KgsG.Weight: 10 Kgs",
    "badge": ""
  },
  {
    "id": "mortising-attachment-kit-ct132",
    "name": "MORTISING ATTACHMENT KIT CT132",
    "imageUrl": "",
    "shortDescription": "If you don't cut mortises all that often and have a drill press, then this tool is just what you need. This mortising attachment and chisel set for your drill press allows you to double-task a machine you likely already have. Made from cast iron and steel, simply attach this tool to your drill press to bore out mortises in a range of sizes including 1/4\", 5/8\", 3/8\" &amp; 1/2\". All the components will stay organized and safe in the included plastic case. FEATURESDurable cast iron &amp; steelPlastic case keeps parts organizedAllows mortising without buying a dedicated machineINCLUDES1 Fence1 Hold down2 Hold in1 Chisel holder (65mm)4 Mortising chisels &amp; bits 1/4\", 5/8\", 3/8\" &amp; 1/2\"4 Plastic quill rings - 40mm, 52.5mm, 55mm, 60mmBlow molded case",
    "badge": ""
  },
  {
    "id": "12-5in-planer-with-helical-cutterhead-cra-cx125hc",
    "name": "12.5\" HELICAL HEAD PLANER",
    "imageUrl": "",
    "shortDescription": "",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x-30in-220g",
    "name": "SANDING BELT 1\" X 30\" 220G",
    "imageUrl": "",
    "shortDescription": "B130R220 Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 220",
    "badge": ""
  },
  {
    "id": "abrasive-cleaner-1-1-2in-x-1-1-2in-x-8-1-2",
    "name": "ABRASIVE CLEANER 1 1/2\" X 1 1/2\" X 8 1/2",
    "imageUrl": "",
    "shortDescription": "Think of this abrasive cleaner as a giant eraser that removes debris from all of your abrasives. This cleaner is ideal for all abrasives but does a fantastic job on belts and discs that always pack up with dust and pitch. Whether your abrasives are clogged up with wood, fiberglass, plastic or metal, you can get extra life out of your belts and discs with this abrasive cleaner.",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x-30in-120g",
    "name": "SANDING BELT 1\" X 30\" 120G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 120",
    "badge": ""
  },
  {
    "id": "sanding-pack-4pc-set-turnerft-s-1in-x-20ft",
    "name": "SANDING PACK 4PC SET TURNERS 1\" X 20'",
    "imageUrl": "",
    "shortDescription": "Turners often need to work through various grits of abrasive when preparing a project for finishing. This sanding pack is an ideal solution, providing all the necessary abrasives in one convenient package. The cloth-backed 1\" wide strips are perfect for matching the intricate details of turned projects. Each box contains 4 rolls of 20' lengths in 150, 240, 320, and 400 grits. The dispenser box keeps the different grits separated and organized, allowing you to easily rip off the required length and start sanding. This sanding pack offers excellent value for both turning and general woodworking projects.",
    "badge": ""
  },
  {
    "id": "planer-13in-with-folding-table-and-blade",
    "name": "PLANER 13\" WITH FOLDING TABLE AND BLADE",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this Planer and get a FREE in-depth Planer course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase. Click here for more info",
    "badge": ""
  },
  {
    "id": "drill-stops-7pc-set",
    "name": "DRILL STOPS 7PC SET",
    "imageUrl": "",
    "shortDescription": "The B734 Drill Stops 7pc Set is an essential tool for ensuring precise and consistent drilling depths. Perfect for woodworking, metalworking, or any application requiring controlled drilling, these stops eliminate guesswork and prevent over-drilling. By securely attaching to drill bits, they provide accuracy and help avoid costly errors. Designed to fit a wide range of drill bit sizes, this set is a versatile and handy addition to any shop or toolbox.",
    "badge": ""
  },
  {
    "id": "1in-belt-sander-craftex-cx-series",
    "name": "1\" BELT SANDER CX510",
    "imageUrl": "",
    "shortDescription": "CX510 1\" x 30\" Belt Sander - Craftex CX Series  This compact and versatile belt sander is portable and ideal for fine woodwork. With its multiple adjustment options, this bench top machine gets the job done to your desired specifications. The sander features powerful 1/3HP motor, adjustable belt tracking, and rubber feet for minimal vibration and is dust collection ready with a 1-3/4\" dust port. The sander also features a removable back plate, ideal for sanding odd stock and curved pieces. Like all CX-Series machines, this unit features powder coated paint and a full 3 year warranty. Motor: 1/3HP, 120V, 60 Hz Amps: 3 Belt Speed: 3450 FPM Sanding Belt Size: Length 30\" x Width 1\" Tilting Die Cast Aluminum Table (0 to 45 degrees) Table Size: 5” x 5” Dust Port: 1-3/4\" OD Weight: 16 lbs 3 Year Warranty",
    "badge": ""
  },
  {
    "id": "oscillating-spindle-sander-14in-craftex",
    "name": "OSCILLATING SPINDLE SANDER 14\"",
    "imageUrl": "",
    "shortDescription": "CX508 14\" Oscillating Spindle Sander - Craftex CX-Series Don't let the compact size fool you. This small oscillating spindle sander is packed with great features. Featuring 14\" cast iron work table, different diameters of sanding drums and interchangeable metal table inserts, sanding curves &amp; shapes is a breeze with this sander. The ON/OFF switch features a removable key that prevents the sander from unauthorized use and the 2-1/2\" is for optimal dust collection. The sander has built in storage for the extra sanding drums, sanding sleeves and table inserts. (comes with 100 Grit Sleeves) Great small sander for hobbyist and serious woodworkers. Like all CX-Series machines, this unit features powder coated paint and a full 3 year warranty.   SPECIFICATIONS Motor: 1/4-HP, 120-V, 60-HzAmps: 2.6 AmpsPower Switch: ON/OFF with Removable Locking KeyNo Load Speed: 1725 RPMSpeed: 30 OPMStroke: 5/8\"Table Top Diameter: 14\"Includes 6 Sanding Drums, 6 Sanding Sleeves (1/2”, ¾”, 1”, 1 ½”, 2”, 3”)Includes 6 Metal InsertsWarranty: 3 Years",
    "badge": ""
  },
  {
    "id": "abrasive-belt-and-disc-cleaner-2in-x2in-x12in",
    "name": "ABRASIVE BELT & DISC CLEANER 2\"X2\"X12\"",
    "imageUrl": "",
    "shortDescription": "Think of this abrasive cleaner as a giant eraser that removes debris from all of your abrasives. This cleaner is ideal for all abrasives but does a fantastic job on belts and discs that always pack up with dust and pitch. Whether your abrasives are clogged up with wood, fiberglass, plastic or metal, you can get extra life out of your belts and discs with this abrasive cleaner.  FEATURES  Extends the life of abrasive up to 10 times Suitable for wood, fibreglass, plastic and metal Size: 2\" x 2\" x 12\"",
    "badge": ""
  },
  {
    "id": "grinder-and-sander-8in-x-2in-combo-craftex-ct169n",
    "name": "8\" X 2\" GRINDER SANDER COMBO MACHINE",
    "imageUrl": "",
    "shortDescription": "CT169N     Bench Grinder &amp; Belt Sander Combo – Craftex  The CT169N grinder and sander combo tool is perfect for knife honing, tool sharpening and sanding small parts. The 1/2-HP, 120-Volts motor provides a 3450 RPM grinding speed to handle just about any metal grinding job. The sanding belt is 28” x 2” used to sand both soft wood and hard wood. The belt sander can be tilted through 90-degree from horizontal position to vertical position and can be locked to any angle in between. The grinding wheel features an eye shield to protect the operators face from sparks produced while grinding.  CT169N is equipped with a 1-1/8” dust port to remove the dust produced while sanding and a work lamp for increased operation visibility.  SPECIFICATIONS:  Motor: 1/2-HP, 120-Volts, Single Phase, 60-Hz No Load Speed: 3450 RPM Amps: 2.5 Amps Grinding Wheel Diameter: 8” Grinding Wheel Material: Aluminum Oxide Grinding Wheel Grit: 36# Sanding Belt Size: Length 28” x Width 2” Belt Angle: 0 – 90-Degree Dust Port: 1-1/8” Light Bulb: 12-V, 10-W Weight: 18.50 Kgs 2 Year Warranty",
    "badge": ""
  },
  {
    "id": "magnetic-light",
    "name": "MAGNETIC WORKSHOP LIGHT",
    "imageUrl": "",
    "shortDescription": "This magnetic light is a versatile and convenient solution for illuminating your workspace. Designed with a powerful magnetic base, it securely attaches to any metal surface, providing hands-free lighting exactly where you need it. The flexible gooseneck allows for easy adjustment, ensuring optimal light positioning for detailed tasks. Compact and portable, this magnetic light is perfect for workshops, garages, or any area where focused illumination is required.",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x-30in-80g",
    "name": "SANDING BELT 1\" X 30\" 80G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 80",
    "badge": ""
  },
  {
    "id": "brush-glue-brush-set-50pcs",
    "name": "BRUSH GLUE BRUSH SET 50PCS",
    "imageUrl": "",
    "shortDescription": "D2026  50 Pc. Glue Brush Set  The best guarantee for a fail-safe glue joint is to spread the glue evenly over the entire surface. The best way to spread glue is with one of these disposable glue brushes. Small enough to fit into tight mortises, yet large enough to spread glue quickly, these glue brushes belong in every woodshop. Plumbers and pipe fitters also use these brushes for flux and pipe dope.  QTY: 50 Pieces",
    "badge": ""
  },
  {
    "id": "abrasive-cleaner-1-3-8in-x-1-3-8in-x-6in",
    "name": "ABRASIVE CLEANER 1 3/8\" X 1 3/8\" X 6\"",
    "imageUrl": "",
    "shortDescription": "Think of this abrasive cleaner as an eraser that removes debris from all of your abrasives. This cleaner is ideal for all abrasives but does a fantastic job on belts and discs that always pack up with dust and pitch. Whether your abrasives are clogged up with wood, fiberglass, plastic or metal, you can get extra life out of your belts and discs with this abrasive cleaner. FEATURESExtends the life of abrasive up to 10 timesSuitable for wood, fibreglass, plastic and metalSize: 1-3/8\" x 1-3/8\" x 6\"",
    "badge": ""
  },
  {
    "id": "foam-brush-set-24pc",
    "name": "FOAM BRUSH SET 24PC",
    "imageUrl": "",
    "shortDescription": "D2031 24PC Foam Brush Set  This set offers a wide range of assorted sizes. Great for all water and oil based stains.",
    "badge": ""
  },
  {
    "id": "safety-push-stick",
    "name": "SAFETY PUSH STICK",
    "imageUrl": "",
    "shortDescription": "The B2007 Safety Push Stick is an essential tool for maintaining safety and precision in your workshop. Designed to keep your hands at a safe distance from cutting tools while still providing excellent control and support for small workpieces, this push stick is a must-have for woodworking projects. Its ergonomic design ensures a secure grip and precise maneuvering, helping you work safely and confidently.",
    "badge": ""
  },
  {
    "id": "chuck-set-for-wood-lathe",
    "name": "CHUCK SET FOR WOOD LATHE 2.75\"",
    "imageUrl": "",
    "shortDescription": "Enhance your woodturning projects with this versatile Chuck Set for Wood Lathes. Designed to secure a variety of workpieces with precision and ease, this set is an essential tool for both novice and experienced woodturners. It includes a robust four-jaw self-centering chuck and multiple interchangeable jaws, providing the flexibility needed for a wide range of turning applications. This chuck set fits a 1\" x 8 TPI spindle, ensuring compatibility with most wood lathes.",
    "badge": ""
  },
  {
    "id": "apron-b2615",
    "name": "BUSY BEE SHOP APRON WITH POCKETS",
    "imageUrl": "",
    "shortDescription": "The 11 Pocket Shop Apron is designed for durability and functionality, making it ideal for various tasks in the shop, home, garden, and more. Constructed from tough nylon material, this apron is built to withstand the test of time and heavy use. It features an adjustable neck and waist strap, ensuring a comfortable fit for all users.",
    "badge": ""
  },
  {
    "id": "chisel-set-8-pc-woodturning",
    "name": "8PC BEGINNERS WOODTURNING SET",
    "imageUrl": "",
    "shortDescription": "The B316 8pc Woodturning Chisel Set is a high-quality wood lathe chisel set offered at an excellent price. This comprehensive set includes 8 essential chisels ideal for turning spindles, pens, bowls, and various other projects. Crafted from high carbon steel, the 4-1/4\" blades ensure durability and long-lasting use. The chisels have an overall length of 14\", providing ample reach and control. Features  High Carbon Steel Blades: Durable and long-lasting, ensuring years of use. Comprehensive Set: Includes 8 essential chisels for various woodturning tasks. Optimal Length: 14\" overall length for better control and precision.  Specifications  Blade Length: 4-1/4\" Overall Length: 14\" Material: High carbon steel  Comes With  3/16\" Parting Tool 5/8\" Spear Scraper 1\" Skew Chisel 5/8\" Skew Chisel 5/8\" Round Nose Scraper 1/2\" Bowl Gouge 3/4\" Spindle Gouge 7/8\" Roughing Gouge Storage Box: Handy box for convenient storage and transport",
    "badge": ""
  },
  {
    "id": "drill-press-table",
    "name": "DRILL PRESS TABLE B2660",
    "imageUrl": "",
    "shortDescription": "This Universal Drill Press Table is designed to fit most drill press models. The large table has a quick clamping system that will not damage your original tabletop and adds versatility to your press by giving you a larger workspace and increasing accuracy. To complete this package, the universal tabletop comes complete with a 3\" fence and a stop block which both slide along the T-track slot.",
    "badge": ""
  },
  {
    "id": "universal-fence-clamp-3in-to-4-5in-2pc",
    "name": "UNIVERSAL FENCE CLAMP 3\" TO 4.5\" 2PC",
    "imageUrl": "",
    "shortDescription": "The B3059 2-pc Universal Fence Clamps make securing shop-made auxiliary fences quick and effortless. Designed to hold fences from 3\" to 4-1/2\" thick, these clamps attach without interfering with your workpiece, ensuring smooth and accurate cuts.",
    "badge": ""
  },
  {
    "id": "1-4in-solid-carbide-spiral-up-cut-bit-1-4",
    "name": "1/4\" SOLID CARBIDE SPIRAL UP CUT ROUTER",
    "imageUrl": "",
    "shortDescription": "These bits are excellent at removing material quickly and efficiently, leaving behind a smooth and clean surface. Made from solid carbide, these bits are great for cutting mortises, grooves, dadoes and routing deep blind holes in all composition materials, plywood, hardwood &amp; softwood.  SPECIFICATIONS  Cutting Diameter: 1/4\" Cutting Length: 1\" Overall Length: 2-1/2\" Shank Diameter: 1/4\"  Craftex Blue Tornado bits are CNC machined to have perfect balance and leave a smooth finish. All bits are manufactured from 4140 &amp; 5140 steel and are put through a special heat treatment process to ensure proper hardness and tensile strength to prevent bending or breaking. Tungsten micro-grain C3 carbide gives the cutter long-lasting strength that can be sharpened many times over.  Craftex Blue Tornado bits have an anti-kickback design along with a non-stick coating for easy pitch removal. Finished with an automotive semi-transparent finish, to give a long-lasting shine. All Craftex Blue Tornado router bits and shaper cutters are backed by a limited, life-time warranty.",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x-30in-180g",
    "name": "SANDING BELT 1\" X 30\" 180G",
    "imageUrl": "",
    "shortDescription": "B130R180 Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 180",
    "badge": ""
  },
  {
    "id": "utility-track-24in",
    "name": "24\" ALUMINUM UTILITY T TRACK",
    "imageUrl": "",
    "shortDescription": "The 24” Utility Track from Craftex is designed for creating custom shop jigs. Its solid aluminum construction ensures durability and reliability. This track can be mounted with screws or epoxy, making it versatile for various applications. It uses standard 1/4\" - 20 hex bolts, and for a flush mount, it requires 3/4\" material.",
    "badge": ""
  },
  {
    "id": "drill-chuck-1-2in-shank-mt2in",
    "name": "DRILL CHUCK 1/2\" SHANK MT2\"",
    "imageUrl": "",
    "shortDescription": "B3217Drill Chuck with 1/2\" MT2 ShankPrecision chuck for drilling, boring, counter-boring, and milling operations which requires heavy penetration. Manufactured to a high degree of accuracy and durability. All parts subject to wear and are heat-treated and ground.MT2 Shank",
    "badge": ""
  },
  {
    "id": "router-table-w-stand-and-fence-b2944",
    "name": "ROUTER TABLE WITH FENCE AND STAND",
    "imageUrl": "",
    "shortDescription": "This router table combo is a comprehensive solution for both professional workshops and home DIY enthusiasts. It features a robust M.D.F. table and fence equipped with a dust port, a universal table insert, and a durable steel stand with non-marring rubber feet to ensure stability and protect your work surface.",
    "badge": ""
  },
  {
    "id": "folding-table-for-dw735",
    "name": "FOLDING TABLE FOR DW735",
    "imageUrl": "",
    "shortDescription": "\"DeWalt\" 13\" Folding Tables Include two tables and hardware kit",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x-30in-150g",
    "name": "SANDING BELT 1\" X 30\" 150G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 150",
    "badge": ""
  },
  {
    "id": "brushes-disposable-12-pack-half-inch",
    "name": "12PC DISPOSABLE BRUSHES FOR WOODWORKING",
    "imageUrl": "",
    "shortDescription": "These 1/2\" wide disposable brushes are perfect for evenly spreading glue in a variety of woodworking, crafting, or household projects. Designed for convenience and precision, these brushes feature stiff bristles that provide excellent control, ensuring an even application every time. With a compact 5 1/4\" length and sturdy 3/4\" bristle area, they’re ideal for detailed work or applying adhesives in tight spaces. Each pack contains 12 brushes, making them a cost-effective and practical choice for any shop or DIY project.",
    "badge": ""
  },
  {
    "id": "gauge-2-in-1-router-table-saw",
    "name": "2 IN 1 GUAGE FOR WOODWORKING",
    "imageUrl": "",
    "shortDescription": "The 2-in-1 Router Depth &amp; Saw Gauge is a versatile, all-in-one tool designed to make setting up your table saws, band saws, and routers fast and efficient. This precision-engineered gauge features a step gauge for accurate height adjustments and a router depth gauge for detailed setups. Whether you're a professional woodworker or a DIY enthusiast, this tool ensures precision and consistency in every project.",
    "badge": ""
  },
  {
    "id": "safety-face-shield-nih-aproved",
    "name": "SAFETY FACE SHIELD NIH APPROVED",
    "imageUrl": "",
    "shortDescription": "This Professional Protection Reusable Safety Face Shield is engineered to provide comprehensive facial protection against external threats, covering a large area from the eyebrows to the chin. The shield is designed to safeguard your eyes, nose, and mouth from droplets, saliva, splashes, oil, dust, and other airborne particles. Built with a durable, transparent lens, the face shield offers excellent visibility without distortion. Lightweight and breathable, it’s ideal for use in healthcare, industrial settings, or any environment where maximum protection is required.",
    "badge": ""
  },
  {
    "id": "planer-13in-dual-speed-dewalt",
    "name": "PLANER 13\" DUAL SPEED DEWALT",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this Planer and get a FREE in-depth Planer course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase. Click here for more info13\" Planer Dual Speed - DEWALT",
    "badge": ""
  },
  {
    "id": "drill-stand-1-16in-1-2in",
    "name": "DRILL STAND 1/16\" - 1/2\"",
    "imageUrl": "",
    "shortDescription": "Keep your drill bits neatly organized and within easy reach with our Drill Indexing Stand. Designed for both bench-top and wall-mounted use, this stand provides quick and convenient access to your drill bits, whether you're working in a shop, garage, or workspace.",
    "badge": ""
  },
  {
    "id": "general-safety-face-shield-15in-x-8in",
    "name": "GENERAL SAFETY FACE SHIELD  15\" X 8\"",
    "imageUrl": "",
    "shortDescription": "The B3183 15\" x 8\" Face Shield is designed for professional use, providing comprehensive protection for the face and neck against chemical splashes and flying particles. It features a tough, polycarbonate, replaceable window that ensures durability and high impact resistance over a wide range of temperatures. The shield is engineered with a patented attachment system and is five-system hole punched to fit Crews Headgear. This face shield is stronger, more durable, and more heat resistant, making it ideal for various industrial applications.",
    "badge": ""
  },
  {
    "id": "feather-board-safety-5-pc-set",
    "name": "5PC FEATHER BOARD SAFETY SET",
    "imageUrl": "",
    "shortDescription": "B3276 5pc Featherboard Safety Set is designed to enhance safety during woodworking operations. This 5-piece set is essential for keeping hands safely away from cutting blades while using table saws, router tables, shaper tables, and jointers. The set includes tools such as push sticks, a push block, a notch stick, and a featherboard, all crafted to provide precision and control while maintaining safety in the workshop.",
    "badge": ""
  },
  {
    "id": "carbide-cutters-14-3x14-3x2mm-10-pcs-for",
    "name": "CARBIDE CUTTERS 14.3X14.3X2MM 10 PCS FOR",
    "imageUrl": "",
    "shortDescription": "10pc/Pack Insert for Helical Cutterhead Machines - Craftex CX-Series These high quality Carbide cutter inserts are used with our CX125HC &amp; CX13HC Bench Top Helical Planers and our CX08BTHC Bench Top Helical Jointer machines giving smoother and superior finish compared to straight knife cutters. These cutters will fit other manufacture model as well, confirm your insert size is 14.3mm x 14.3mm x 2mm before purchasing.   Quantity: 10 pcs / Pack Material: High Quality Carbide Size of Inserts (double sided): 14.3mm x 14.3mm x 2mm IMPORTANT CXHCINS2 will fit all machines listed in the chart below. INSERT SIZE 14.3mm x 14.3mm x 2mm  Fits the following machines:     BRAND   MODEL#   DESCRIPTION     Craftex CX-Series   CX125HC   Planer 12.5” with Helical cutterhead     Craftex CX-Series   CX13HC   Planer 13” with Helical cutterhead     Craftex CX-Series   CX08BTHC   Jointer 8\" with helical cutterhead     King   KC-13HPC   Planer 13\" with helical cutterhead     King   KC-8HJC   Jointer 8\" with helical cutterhead     Magnum (KMS Tools)   MI-31160   Planer 13\" with helical cutterhead     Magnum (KMS Tools)   MI-81180   Jointer 8\" with helical cutterhead",
    "badge": ""
  },
  {
    "id": "tenoning-jig-craftex",
    "name": "TENONING JIG CRAFTEX",
    "imageUrl": "",
    "shortDescription": "Super Tenon Jig All cast iron to fit any 3/4\" table slot with adjusters for fit Screw clamping to 5\" clamping plate with adjustment to 20 degree from vertical 45 degree fence to allow compound angles Micro adjustment Two handles for control Designed to fit contractor and cabinet saws",
    "badge": ""
  },
  {
    "id": "shop-fox-mobile-base-700lb-cap-d2057a",
    "name": "SHOP FOX MOBILE BASE 1000LB CAP D2057A",
    "imageUrl": "",
    "shortDescription": "D2057A  Adjustable Mobile Base with 1000 lbs Capacity- ShopFox  Adjustable from 20\" x 20\" to 29-1/2\" x 29-1/2\"  New &amp; improved version of the popular Shop Fox mobile bases features better overall construction &amp; design.  Used for a stable and mobile platform upon which to mount machinery and equipment having a variety of base sizes and weights. New and improved castors are arranged on outriggers allowing the machine to sit as low as possible and yet be extremely stable and have excellent maneuverability. The base can be assembled in any of eight configurations providing maximum flexibility. The two-piece retractable feet uses earth magnets to allow the knob to turn while the foot pad is tight to the floor.  Strong, extremely stable, outrigger supports.  Capacity: 1000 lbs.",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x30in-x60g",
    "name": "SANDING BELT 1\"X30\"X60G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 60",
    "badge": ""
  },
  {
    "id": "aluminum-router-table-plate-insert-9in-x",
    "name": "ALUMINUM ROUTER TABLE INSERT PLATE 9\" X",
    "imageUrl": "",
    "shortDescription": "The B3494 Aluminum Router Table Plate Insert is designed to provide robust support for even the heaviest routers without sagging. The plate is crafted from durable 1/4\" thick aluminum and measures approximately 9\" x 12\".",
    "badge": ""
  },
  {
    "id": "planer-blades-15in-3-pc-set",
    "name": "PLANER BLADES 15\" 3 PC SET",
    "imageUrl": "",
    "shortDescription": "Planer blades for 15\" planers  Fits Craftex Models CT055, B350 &amp; Delta Model 22790X  For other brands or models of planers, check your original blade size. These popular blades represent good value for the money and good quality.  Size - 15\" x 1\" x 1/8\" HSS",
    "badge": ""
  },
  {
    "id": "router-bit-catalogue-2021",
    "name": "ROUTER BIT CATALOGUE",
    "imageUrl": "",
    "shortDescription": "Craftex Blue Tornado Router Bit Catalogue This flyer is free, add to cart to remove cost. Shop a wide selection of high-quality router bits through our Router Bit Catalogue. Add one to your cart and get a free copy with your order or pick one up in store. To view a digital version of this catalogue - click here To join our mailing list – click here",
    "badge": ""
  },
  {
    "id": "knife-setting-gauge-universal",
    "name": "KNIFE SETTING GAUGE UNIVERSAL",
    "imageUrl": "",
    "shortDescription": "The Knife Setting Gauge Universal is designed for quick and accurate setting of knives. This tool ensures precision and ease of use with its micrometer scales and magnetic jigs.",
    "badge": ""
  },
  {
    "id": "jointer-blades-6in-x-5-8in-x-1-8in-3pc-set-b706n006",
    "name": "JOINTER BLADES 6\" X 5/8\" X 1/8\" 3PC SET B706N006",
    "imageUrl": "",
    "shortDescription": "Extra H.S.S. Blades for Model B706N Set of 3 - 6\" x 5/8\" x 1/8\"",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr220",
    "name": "2\" X 28\" SANDING BELT 220 GRIT",
    "imageUrl": "",
    "shortDescription": "CT169220  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 220",
    "badge": ""
  },
  {
    "id": "sanding-drum-set-16-pc",
    "name": "SANDING DRUM SET 16 PC",
    "imageUrl": "",
    "shortDescription": "B3393  16pc 2\" Sanding Drum Set  Rubber drum size: 1/2\" x 2\", 3/4\" x 2\", 1\" x 2\", 1-1/2\" x 2\" 1 each Fine, Medium and Coarse for each size drum sanding sleeve",
    "badge": ""
  },
  {
    "id": "disc-sander-12in-cx506",
    "name": "12\" DISC SANDER",
    "imageUrl": "",
    "shortDescription": "CX506 12\" Disc Sander - Craftex CX-Series Powered by a 1.2 HP motor this 12\" disc sander operates at a speed of 1750 RPM and is designed for accuracy and efficiency. The 16-3/8\" x 6-7/8\" table provides a solid work surface, tilts between 0° - 45° and locked in position making sanding an easy operation. For added safety the ON/OFF switch features a locking pin which helps prevent the sander from unauthorized usage. The sander has a 2\" dust port at the back for optimum dust removal.   SPECIFICATIONS Motor: 1.2-HP, 120-V, 60-Hz, 8.0 Amps, Single Phase Disc Speed: 1750 RPM Power Switch: ON/OFF with Removable Locking Key Disc Diameter: 12\" Table Size: 16-3/8\" x 6-7/8\" Table Tilt: 0 - 45° Table Height: 7\" DustPort Size: 2\" Miter Gauge: Yes Gross Weight: 63 lbs Warranty: 3 Years",
    "badge": ""
  },
  {
    "id": "aluminum-miter-track-32in-p294402",
    "name": "32\" ALUMINUM MITER T TRACK",
    "imageUrl": "",
    "shortDescription": "This Aluminum Miter Track is a versatile and essential addition to any woodworking setup. This 32-inch track is designed to work seamlessly with standard 3/4\" x 3/8\" miter gauges, whether they come with or without a T-slot. It effortlessly slides into miter tracks or miter slots on your table saw, making it a perfect fit for table saw extensions, drill press tables, and band saw tables. The track features five pre-drilled holes, ensuring easy and secure installation.",
    "badge": ""
  },
  {
    "id": "13in-helical-planer-2-speeds-craftex-cx-s",
    "name": "13\" HELICAL HEAD PLANER 2 SPEEDS",
    "imageUrl": "",
    "shortDescription": "",
    "badge": ""
  },
  {
    "id": "10in-bandsaw-with-stand-csa-cx-series",
    "name": "10\" BANDSAW WITH STAND CX118",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this bandsaw and get a FREE in-depth Bandsaw course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase.  Click here for more info",
    "badge": ""
  },
  {
    "id": "grr-ripper-advanced-dvd-microjig",
    "name": "GRR-RIPPER ADVANCED",
    "imageUrl": "",
    "shortDescription": "GR200BY  Advanced GRR-Ripper with Push Block - MICROJIG Enjoy the ultimate workshop companion. This advanced model of the GRR-Ripper utilizes all the same innovative features of the GR-100 but comes with two additional accessories that improve the control and expandability of the GRR-Ripper System. The GR200 is built to meet the needs of the professional woodworker or extreme hobbyist. With enhanced versatility features, the GR200 will perform operations that were before very dicey and time-consuming with ease and speed. Whether you are making razor-thin veneer strips, building miniatures, or creating exquisite furniture you will save time, materials, and fingers with the GRR-Ripper.  The GR-200 includes these additional accessories:  THE ADJUSTABLE SPACER - This accessory adds increased gripping surface for tackling larger stock. It also adds one inch of cutting width to the GRR-Ripper. Also, acts as a secondary balance support for small stock and straight-line ripping. Great add-on for working on the Router Table, and eliminating snipe.  THE STABILIZING PLATE - The Stabilizing Plate adds a new dimension of control to the GRR-Ripper. It is particularly useful when cutting small narrow pieces of stock. Perfect for trickier cuts like re-sawing, bevel edging, pattern routing, and much more. The Stabilizing Plate also performs as the secondary fence that travels with the GRR-Ripper along the left side of the stock. It holds the off-cut piece in its original position through the entire cutting operation. Some users call it a \"Feather Board Plate\" without the force to pinch the stock into the saw blade.",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr120",
    "name": "2\" X 28\" SANDING BELT 120 GRIT",
    "imageUrl": "",
    "shortDescription": "CT169120  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 120",
    "badge": ""
  },
  {
    "id": "chisel-wood-turning-6-pc-set",
    "name": "6PC CHISEL WOOD TURNING SET",
    "imageUrl": "",
    "shortDescription": "Experience the best in wood turning with the Chisel Wood Turning 6 PC Set B2351 - a high-quality set of tools that is designed to elevate your craft. Made from durable High Speed Steel and featuring large ash handles and brass ferrules, these chisels are built to last and offer maximum control and precision.",
    "badge": ""
  },
  {
    "id": "6in-buffer-3-4hp-craftex-ct188",
    "name": "6\" BUFFER 3/4HP",
    "imageUrl": "",
    "shortDescription": "6\" Buffer - CraftexThe CT188 features a powerful 3/4HP motor which operates at 3450 RPM and is a great tool for buffing and polishing wood, plastics, rocks, brass, copper, metals, jewellery.  FEATURES   Powerful 3/4 HP, 4.8 amp. motor operates at 3450 RPM Dynamically balanced armature assembly provides smooth operation 1/2\" Bore Includes spiral sewn wheel and soft buffing wheel 2 year warranty   SPECIFICATIONS   Motor: 3/4 HP Voltage: 120 Amperage: 4.8 Hertz: 60 Phase: Single RPM: 3450 Wheel Diameter: 6\" Bore: 1/2\" Direction of Rotation of the Wheel (from left side): Clockwise Weight : 9 Kgs 2 Year Warranty",
    "badge": ""
  },
  {
    "id": "9in-wood-bandsaw-with-laser-csa-craftex",
    "name": "9\" WOOD BANDSAW WITH LASER",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this bandsaw and get a FREE in-depth Bandsaw course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase.  Click here for more info",
    "badge": ""
  },
  {
    "id": "knife-honer-for-jointer-planer-knives",
    "name": "KNIFE HONER FOR JOINTER PLANER KNIVES",
    "imageUrl": "",
    "shortDescription": "D1123  Jointer/Planer Sharpener  Sharpen planer and jointer knives to a razor keen edge without removing them from cutterheads. The honing tool features two 400 grit stones, a flat stone for sharpening bevels, and a diagonal stone for flat edges. Each stone has four surfaces, which can be adjusted to provide a fresh sharpening surface.  SPECIFICATIONS: 400 Grit 4 Surfaces",
    "badge": ""
  },
  {
    "id": "foot-switch-120v-12a-max-60hz-1ph",
    "name": "FOOT SWITCH FOR POWER TOOL 120V",
    "imageUrl": "",
    "shortDescription": "The Foot Switch is an extremely handy accessory designed for use with scroll saws, table saws, routers, and drill presses. It provides a convenient way to control power tools, ensuring that they only operate when the switch is engaged. This switch enhances safety and efficiency in your workshop by allowing hands-free operation.",
    "badge": ""
  },
  {
    "id": "blade-93-1-2in-x-1-2in-6t",
    "name": "BANDSAW BLADE 93 1/2\" X 1/2\" 6T B227012",
    "imageUrl": "",
    "shortDescription": "Band Saw Blade for Model B227N 14\" Band Saw Length: 93 1/2\" Width: 1/2\" Pitch: 6 Hook Gauge: .025\"",
    "badge": ""
  },
  {
    "id": "drill-chuck-5-8in-jt3",
    "name": "DRILL CHUCK 5/8\" JT3",
    "imageUrl": "",
    "shortDescription": "The Drill Chuck is a precision-engineered tool designed to enhance the accuracy of your drill press. This keyed chuck provides superior gripping force and precision, ensuring reliable performance for various drilling applications. It is ideal for use in portable, bench, or floor-type drill presses.Features•    Keyed chuck for precise and secure tightening•    Enhances the accuracy of your drill press•    Provides strong gripping force•    Suitable for a variety of drilling applications",
    "badge": ""
  },
  {
    "id": "drill-chuck-0-1-2in-jt33",
    "name": "DRILL CHUCK 0-1/2\" JT33",
    "imageUrl": "",
    "shortDescription": "The Economy Drill Chuck is designed to enhance the precision of your drill press. This keyed chuck ensures secure and accurate bit holding, making it ideal for various drilling applications.",
    "badge": ""
  },
  {
    "id": "blade-planer-3pc-set-dewalt",
    "name": "BLADE PLANER 3PC/SET DEWALT",
    "imageUrl": "",
    "shortDescription": "Blades  Replacement blades for the DW735 – DeWalt 13” planer. Knives have locator holes to help align knives on cutter head when changing knives.",
    "badge": ""
  },
  {
    "id": "push-sticks-ft-vft-safety-2pc",
    "name": "PAIR OF SAFETY PUSH STICKS",
    "imageUrl": "",
    "shortDescription": "The B1843 Safety \"V\" Push Stick set is designed to keep hands safely away from cutting tools while maintaining firm control over the workpiece. Made from impact-resistant plastic, these push sticks provide durability and a secure grip for added safety. The \"V\" shape design ensures better workpiece stability and precise maneuvering, making them ideal for use with table saws, jointers, shapers, and router tables.",
    "badge": ""
  },
  {
    "id": "shop-fox-mobile-base-1300lb-cap-d2058a",
    "name": "SHOP FOX MOBILE BASE 1300LB CAP D2058A",
    "imageUrl": "",
    "shortDescription": "D2058A   Super Heavy Duty Mobile Base with 1300 lbs Capacity - ShopFox 18\" x 24\" to 28-1/2\" x 33-1/2\"  The new &amp; improved version of the classic Heavy Duty Shop Fox Mobile Base features overall better construction, new cast iron wheels and infinite adjustability within its range.  Used for a stable and mobile platform upon which to mount machinery and equipment having a variety of base sizes and weights. Heavy-duty metal swivel castors are arranged on outriggers allowing the machine to sit as low as possible and yet be extremely stable and have excellent maneuverability. The base can be assembled in any of eight configurations providing maximum flexibility. The two-piece retractable feet uses earth magnets to allow the knob to turn while the foot pad is tight to the floor.  Adjustable from 18\" x 24\" to 28-1/2\" x 33-1/2\". Strong, extremely stable, outrigger supports.  Capacity: 1300 lbs.",
    "badge": ""
  },
  {
    "id": "1-8in-solid-carbide-spiral-up-cut-bit-1-2",
    "name": "1/8\" SOLID CARBIDE SPIRAL UP CUT ROUTER",
    "imageUrl": "",
    "shortDescription": "These bits are excellent at removing material quickly and efficiently, leaving behind a smooth and clean surface. Made from solid carbide, these bits are great for cutting mortises, grooves, dadoes and routing deep blind holes in all composition materials, plywood, hardwood &amp; softwood.  SPECIFICATIONS  Cutting Diameter: 1/8\" Cutting Length: 1/2\" Overall Length: 2\" Shank Diameter: 1/4\"  Craftex Blue Tornado bits are CNC machined to have perfect balance and leave a smooth finish. All bits are manufactured from 4140 &amp; 5140 steel and are put through a special heat treatment process to ensure proper hardness and tensile strength to prevent bending or breaking. Tungsten micro-grain C3 carbide gives the cutter long-lasting strength that can be sharpened many times over.  Craftex Blue Tornado bits have an anti-kickback design along with a non-stick coating for easy pitch removal. Finished with an automotive semi-transparent finish, to give a long-lasting shine. All Craftex Blue Tornado router bits and shaper cutters are backed by a limited, life-time warranty.",
    "badge": ""
  },
  {
    "id": "blade-93-1-2in-x-1-4in",
    "name": "BANDSAW BLADE 93 1/2\" X 1/4\" B227014",
    "imageUrl": "",
    "shortDescription": "Band Saw Blade for Model B227N 14\" Band Saw Length: 93 1/2\" Width: 1/4\" Pitch: 10 Raker Gauge: .025\"",
    "badge": ""
  },
  {
    "id": "feather-board-milescraft",
    "name": "FEATHER BOARD MILESCRAFT",
    "imageUrl": "",
    "shortDescription": "Feather Board from Milescraft  A unique and very effective feather board features Dual Slide Motion for quick and easy set up. Unique pre-load tension design for consistent tension Split-rail miter bars provide maximum hold S style knobs prevent over tightening and provides non-slip removal  Also available in Double Tandem Feather Board as well (Model # 1407)",
    "badge": ""
  },
  {
    "id": "blade-10-x-60-x-5-8in-tcg-freud",
    "name": "FREUD 10\" X 60\" 5/8\" TCG BLADE",
    "imageUrl": "",
    "shortDescription": "LU82M010  10\" 60-Teeth Multi-Purpose Saw Blade - FREUD  An ideal saw blade for precise crosscuts in softwood, hardwood, fine moldings, and picture frame molding Thick MicroGrain carbide tips allow for more cuts between sharpening Laser-cut anti-vibration slots drastically reduce vibration and sideways movement in the cut Triple-chip grind tooth design for extremely smooth, glue line rips  This 10\" Crosscutting and Ripping saw blade delivers fast, true cuts in high volume professional settings. The blade features 60 high density carbide tip teeth and is coated with Freud's Silver I.C.E coating which helps reduce heat build-up and prevent corrision.  Size: 10\" Number of Teeth: 60 Arbor Size: 5/8\"",
    "badge": ""
  },
  {
    "id": "vise-clamp-9in",
    "name": "9\" VISE CLAMP",
    "imageUrl": "",
    "shortDescription": "The 9\" Drill Press Vise Clamps are an essential tool for any workshop, providing a quick and secure method to hold your workpieces in place during drilling operations. These clamps ensure safety and stability, allowing you to focus on precision and efficiency while minimizing the risk of movement or injury. Designed with durability and user safety in mind, they offer a reliable grip for a wide variety of materials. Whether you're a professional or a DIY enthusiast, having at least one of these clamps is critical for safe and accurate drilling work.",
    "badge": ""
  },
  {
    "id": "spiral-cutterhead-for-dw735-dewalt-13in",
    "name": "SPIRAL CUTTERHEAD FOR DEWALT 13\"PLANER D",
    "imageUrl": "",
    "shortDescription": "Exclusive to Busy Bee Tools, this new spiral cutterhead, with carbide inserts, is designed to fit the DW735 Dewalt Planer. This cutterhead is designed tested and manufactured in the same factory in Taiwan that makes the DW735 Planer so you can feel confident not only in an exact fit, but also in the precision high quality design. With the CX735SPIRAL Cutterhead and the staggered insert design you won't have to worry about replacing your knives when they get chipped as you simply just rotate the insert by 90° to expose a new sharp edge. Every insert is marked with and indicator in one corner allowing you to keep track of how many times that insert has been rotated. Your CX735SPIRAL cutterhead will significantly lessen the noise from your thickness planer during operation as you are no longer having the entire length of the cutterhaed making a single cut, you now have multiple stepped cuts made across the length of the cutterhaed decreasing the noise produced and providing a much smother cleaner finish then your conventional straight knives.  Features: Significantly quieter cuts Significantly reduces tearout 2.5 mm carbide Inserts Replace only damaged inserts by rotating 90° Inserts overlap row to row Includes 5 pc extra insert pack &amp; T Wrench  Specifications: Cutterhead Length: 13\" Number of Carbide inserts: 30 Size: 15mm x 15mm x 2.5T",
    "badge": ""
  },
  {
    "id": "live-centre-mt2-for-wood-lathe",
    "name": "LIVE CENTRE MT2 FOR WOOD LATHE",
    "imageUrl": "",
    "shortDescription": "The B1320 Live Centre MT2 is designed for wood lathes, providing smooth and reliable rotation during turning operations. Featuring an MT2 taper, this live centre ensures a secure fit in the lathe tailstock for stability and precision.",
    "badge": ""
  },
  {
    "id": "drill-chuck-0-1-2in-jt6",
    "name": "DRILL CHUCK  0-1/2\" JT6",
    "imageUrl": "",
    "shortDescription": "The B045 Drill Chuck is a high-precision, keyed chuck designed to enhance the accuracy of your drill press. It features a robust construction and precise engineering, making it ideal for a variety of drilling applications. The chuck ensures a secure grip on drill bits, contributing to precise and accurate drilling operations.",
    "badge": ""
  },
  {
    "id": "blade-93-1-2in-x-3-8in-6t",
    "name": "BANDSAW BLADE 93 1/2\" X 3/8\" 6T B227038",
    "imageUrl": "",
    "shortDescription": "B227038  Band Saw Blade for Model B227N 14\" Band Saw  Length: 93-1/2\" Width: 3/8\" Pitch: 6 Hook Gauge: 0.025\"",
    "badge": ""
  },
  {
    "id": "blade-planer-3pc-set-13in-fits-dw735",
    "name": "BLADE PLANER 3PC SET 13\" FITS DW735",
    "imageUrl": "",
    "shortDescription": "B3362  3pc, 13\" Planer Blades  These blades are identical to the DW7352 Planer Blades and are designed to fit the DW735 DeWalt Planer.  Our blades are made in the same factory as the DeWalt DW735 13\" Planer and DW7352 Planer blades.  Features locator holes to help align knives on the cutter head when changing knives.",
    "badge": ""
  },
  {
    "id": "chuck-6in-4-jaw-wood-1in-x-8tpi",
    "name": "4 JAW 6\" CHUCK FOR WOOD LATHES",
    "imageUrl": "",
    "shortDescription": "The 6\" 4-Jaw Wood Lathe Chuck is a versatile and reliable tool designed for woodturning applications. Featuring a 1\" x 8 TPI (threads per inch) threading, this chuck securely holds and centers a wide range of material shapes, making it ideal for various woodturning projects. With its durable construction and strong clamping force, it ensures stability and precision during your work. Its ability to hold stock ranging from ½\" to 5-1/2\" makes it suitable for both small and medium-sized wood pieces.",
    "badge": ""
  },
  {
    "id": "live-center-cup-mt-1",
    "name": "LIVE CENTER CUP MT 1",
    "imageUrl": "",
    "shortDescription": "(MT1) Centres for Wood Lathes Cup Centre - Ball Bearing",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-80g",
    "name": "5\" SANDING DISC 10PC 80G",
    "imageUrl": "",
    "shortDescription": "These 5-inch sanding discs are equipped with resin-bonded aluminum oxide grit, making them ideal for use on both wood and metal surfaces. They are also suitable for sanding paint, fillers, primers, and more, providing a versatile solution for various projects.",
    "badge": ""
  },
  {
    "id": "miter-gauge-1000hd-with-18in-to-30in",
    "name": "MITER GAUGE TELESCOPING FENCE 18\" TO 31\"",
    "imageUrl": "",
    "shortDescription": "MITER1000HD  Miter Gauge 1000 High Definition - INCRA   The NEW INCRA Miter 1000HD is the most refined model yet in the Miter 1000 series. The HD stands for High Definition; because the protractor plate's exclusive AngleLOCK Indexing System has a whopping 180 can't-miss angle stops in 1 degree increments with special stops located at 22-1/2 degree. Combine that high-resolution protractor with the industry's smoothest adjustable miter bar, a telescoping IncraLOCK Cut-off Fence &amp; Flip Shop Stop, and a steel vernier scale that reads to 1/10 degree, and you've got a winner that will improve the quality of any project. Are you cutting parts for segmented turning? The Miter 1000HD will allow you to precisely set and quickly duplicate any angle you might need, whether it's 18 degree for cutting 10 sides, 25.7 degree for 7-sided objects, or anything else imaginable.  Telescoping IncraLOCK Fence  This Miter Fence telescopes from 18\" to a full  31\" length and features a front T-slot for adding a wooden zero-clearance sub fence.ÿÿThe Miter 1000HD's Flip Shop Stop is equipped with INCRA's patented incremental positioning racks for incredible cut-length accuracy and 100% day-to-day repeatability.  GlideLOCK Miter Bar   Six expansion disks adjust both sides of the bar for ZERO side play, low-friction travel on all table saws with standard miter gauge channels, including Delta, Craftsman, imports, etc. An excellent fit in the channel directly transfers the Miter 1000HD's incredible accuracy directly to your project. The Miter 1000's adjustable miter bar will fit square-sided miter slots measuring 3/4\" wide, 3/8\" deep, and with or without a 15/16\" T-slot at the bottom. The miter bar's adjustment rangeÿaccommodates actual slot widths between 0.740\" and 0.765\".   1/10th degree Vernier Cursor  Precision angle indexing teeth are laser cut in solid steel to lock in positive angle stops every 1 degree over a 180 degree range, with special stops at 22-1/2 degree. A stainless steel vernier cursor delivers an incredible 1/10th degree resolution between fixed steps.",
    "badge": ""
  },
  {
    "id": "vise-woodworking-16in-quick-release",
    "name": "VISE WOODWORKING 16\" QUICK RELEASE",
    "imageUrl": "",
    "shortDescription": "The 16\" Woodworking Vise with Quick Release is a traditional pattern woodworking vise equipped with a quick-release mechanism. Simply pressing the trigger initiates quick action, allowing the front jaw to slide freely, enabling smooth interchange of large or small workpieces. Releasing the trigger returns the mechanism to normal for fine adjustments, making it highly useful for repetitive work situations.",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr080",
    "name": "2\" X 28\" SANDING BELT 80 GRIT",
    "imageUrl": "",
    "shortDescription": "CT16980  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 80",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-120g",
    "name": "5\" SANDING DISC 10PC 120G",
    "imageUrl": "",
    "shortDescription": "These sanding discs feature a resin-bonded aluminum oxide grit, making them ideal for both wood and metal applications. They are also effective for sanding paint, fillers, primers, and more. Designed for use with sanders that have 8-hole pads, these 5\" discs offer versatility and convenience. The hook-and-loop fastening system allows for quick and easy grit changes, enhancing workflow efficiency. Each package contains 10 sanding discs, perfect for a variety of sanding tasks.",
    "badge": ""
  },
  {
    "id": "18in-open-end-drum-sander-csa-craftex-cx509n",
    "name": "18\" OPEN END DRUM SANDER",
    "imageUrl": "",
    "shortDescription": "CX509N      18\" OPEN END DRUM SANDER We have improved on our original CX509 Drum Sander to bring you the CX509N featuring improved &amp; heavier duty components, mechanics and belt tracking. At a lower price point that traditional drum sanders, this machine offers excellent value to any small to medium workshop. With a small footprint, large sanding capacity &amp; electronic variable speed, this sander will tackle stock up to 36\" wide &amp; 4 ½\" thick. A key feature to this sander is the table moves up and down instead of the head (like most open end sanders on the market). This means sanding operations are more consistent and rigid.  Ideal for flattening and smoothing wide panels as well as reducing thickness without grain tear-out on a wide range of woods. Once this sander is set up in your shop, you will find all kinds of sanding applications that this open end machine can tackle.  In our rigorous testing on this machine and through a few iterations, we have found this machine to be excellent value. Users should pay close attention to the conveyor belt tracking and take the time to set this up correctly upon first use as well as periodically throughout the life of your machine. Follow the steps laid out in the service manual and this machine will provide you with years of service. Like all CX-Series machines, this unit feature powder coated paint, overall heavy duty construction and a full 3 year warranty.  Features:  Electronic Variable Speed Conveyor Stationary Drum: table moves up &amp; down, not head V Belt Drive  Easy change sandpaper Steel Construction   Specifications: Motor: 1.5HP, 110V single phase, 11.5A Electronic Variable Speed Conveyor: 2 - 12 FPM Drum Surface Speed: 4000 FPM 18\" x 44 ½\" Abrasive Conveyor Belt Drum Surface Speed: 4000 FPM Max Stock Dimensions: 36\" W x 4 ½\" H Minimum Board Length: 6\"  Minimum Board Thickness: 1/8\"  Sanding Drum Size: 4\" (uses 3\" wide sandpaper) Dust Collection Port: 4\" Machine Dimensions: 41.5\" x 22.5\" x 50\" Weight: 93kg 3 Year Warranty",
    "badge": ""
  },
  {
    "id": "blade-93-1-2in-x-3-4in",
    "name": "BANDSAW BLADE 93 1/2\" X 3/4\" B227034",
    "imageUrl": "",
    "shortDescription": "Band Saw Blade for Model B227N 14\" Band SawLength: 93 1/2\"Width: 3/4\"Pitch: 4TPI, Hook ToothGauge: .032\"",
    "badge": ""
  },
  {
    "id": "sanding-disc-10in",
    "name": "10\" SANDING DISC",
    "imageUrl": "",
    "shortDescription": "The 10\" Steel Sanding Disc transforms your table saw into a powerful disc sander, providing a large, stable surface for precise sanding. Designed for smooth and efficient material removal, it features a 5/8\" arbor hole for compatibility with most 10\" table saws. Ideal for woodworking projects, this disc enhances versatility and efficiency in your workshop.",
    "badge": ""
  },
  {
    "id": "mitre-gauge-1000se-incra",
    "name": "MITRE GAUGE 1000SE INCRA",
    "imageUrl": "",
    "shortDescription": "MITER1000SE  INCRA MITER GAUGE SPECIAL EDITION  The Miter 1000 Special Edition builds on the excellent foundation provided by the Miter 1000. The Incra exclusive AngleLOCK Indexing System delivers 41 lock solid angle stops in 5-degree increments over a full 180-degree range. Combine this with the included GlideLOCK Miter Bar, Telescoping IncraLOCK Cut-off Fence and the Incra Flip Shop Stop, and you'll easily achieve mitering accuracy that you never thought possible. Whether it's your basic 90-degree cut-off, simple picture frames, or a 20-sided object, the Miter1000SE by Incra delivers perfect, repeatable accuracy.... First time, Every time, Any angle.  GlideLOCK Miter Bar  Six expansion disks adjust both sides of the bar for ZERO side play, anti-friction travel on all table saws with standard 3/4\" x 3/8\" or near-standard miter gauge channels, including Delta, Craftsman, imports, etc. This means that all of INCRA's incredible precision will actually show up in your work because the bar CAN'T wiggle around in the miter slot.  Special Edition Telescoping INCRA-LOCK Fence This Special Edition Miter Fence telescopes from 18\" to a full 31\" length. Includes the Dual Flip Shop Stop and Incra's patented Automatic Positioning Control.  Special Edition 1/10thø Vernier Cursor Precision angle indexing teeth are laser cut in solid steel to lock in positive angle stops every 5-degree over a 180-degree range, with special stops at  22-1/2-degree and 67-1/2-degree. A stainless steel vernier cursor delivers an incredible 1/10thø resolution between fixed steps.",
    "badge": ""
  },
  {
    "id": "mini-wood-lathe-w-digital-read-out-12in-x",
    "name": "12\" X 18\" VARI SPEED WOOD LATHE",
    "imageUrl": "",
    "shortDescription": "",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-240g",
    "name": "5\" SANDING DISC 10PC 240G",
    "imageUrl": "",
    "shortDescription": "These 5\" sanding discs feature a resin-bonded aluminum oxide grit, making them versatile tools suitable for both wood and metal surfaces. They are also effective for sanding paint, fillers, primers, and more, providing a wide range of usage. The quick-change hook and loop fastening system ensures easy switching between different grits, enhancing efficiency and productivity. Designed for use with sanders that have 8-hole pads, these discs provide excellent dust extraction for a cleaner work environment. Each package contains 10 discs, offering ample supply for various projects.",
    "badge": ""
  },
  {
    "id": "live-centre-mt2-b070",
    "name": "LIVE CENTRE MT2 B070",
    "imageUrl": "",
    "shortDescription": "The Precision Live Centres - MT 2 is designed for high-performance and durability in various machining applications. Weighing 1 1/4 lbs, this live centre features a twin bearing mechanism, ensuring smooth and reliable operation. The centre shaft and housing are both hardened and ground for enhanced precision and longevity. The housing is crafted from special steel, providing robust and resilient support during use. Features  Twin Bearing Mechanism: Ensures smooth and reliable operation. Hardened &amp; Ground Shaft and Housing: Enhances precision and durability. Special Steel Housing: Provides robust support and resilience.  Specifications  Type: MT 2 Live Centre Weight: 1 1/4 lbs Mechanism: Twin bearing Material: Steel",
    "badge": ""
  },
  {
    "id": "disc-sanding-12in-80-grit",
    "name": "12\" SANDING DISC 80 GRIT",
    "imageUrl": "",
    "shortDescription": "80-Grit Aluminum Oxide Abrasive Disc 12\" Sanding Replacement Disc for the B023N &amp; B2193  Grit: 80 Diameter: 12\"",
    "badge": ""
  },
  {
    "id": "jointer-blades-6in-3pc-set-6in-x-1in",
    "name": "JOINTER BLADES 6\" - 3PC SET   6\" X 1\"",
    "imageUrl": "",
    "shortDescription": "6\" Jointer Blades for B706 - 3pc. Set  6\" x 1\" HSS.",
    "badge": ""
  },
  {
    "id": "mort-chisel-set-1-4-3-8-1-2-5-16-5-8",
    "name": "5PC MORTISING CHISEL SET",
    "imageUrl": "",
    "shortDescription": "The Mortising Chisel 5pc Set is crafted for precision and durability, providing the perfect solution for creating clean, accurate mortises in wood. Each chisel in the set is designed to handle tough materials with ease, making it ideal for woodworking professionals and enthusiasts. The set includes a range of sizes, ensuring you have the right tool for various mortising tasks. Whether you're working on furniture making, cabinetry, or general woodworking, this set delivers consistent, high-quality results.",
    "badge": ""
  },
  {
    "id": "face-plate-6in-7-8in-x-14-tpi",
    "name": "FACE PLATE 6\" 7/8\" X 14 TPI",
    "imageUrl": "",
    "shortDescription": "Face Plates For Wood Lathe Very Popular| Here is another item that is very handy for use on wood lathes. These faceplates feature conveniently placed screw holes. Make excellent sanding discs. Size: 6\" Thread: 7/8\" x 14 TPI Weight: .4kg",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-180g",
    "name": "5\" SANDING DISC 10PC 180G",
    "imageUrl": "",
    "shortDescription": "These 5\" sanding discs feature a resin-bonded aluminum oxide grit, making them suitable for a wide range of applications including wood, metal, paint, fillers, primers, and more. The quick-change hook and loop fastening system allows for easy switching between different grits, enhancing efficiency and productivity. Designed for use with sanders that have 8-hole pads, these discs ensure effective dust extraction and a cleaner work environment. Each package contains 10 discs, providing ample supply for various projects.",
    "badge": ""
  },
  {
    "id": "band-saw-fence-precision-kreg",
    "name": "BAND SAW FENCE PRECISION KREG",
    "imageUrl": "",
    "shortDescription": "KREG PRECISION BAND SAW FENCE  The KREG fence is  designed to produce an unprecedented level of rigidity, adjustability, and precision. The fence is adjustable in two dimensions for ease in setting it parallel to the blade. Cutting accuracy and repeatability is further enhanced by the precision lens curser that reads off of the included scale. Mounts to most 14 inch band saws available on the market..  Available with an optional Micro-Adjuster. (model # KMS7215)  Features Precision Lens Cursor  Incredibly Strong and Rigid Easy to Remove Adjustable in Two Dimensions Fits Most 14\" Band Saws",
    "badge": ""
  },
  {
    "id": "sanding-belt-6-x-48-80g",
    "name": "SANDING BELT 6 X 48 80G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 6” x 48”  Replacement belt for the B318N, B023N &amp; B2193 Grit: 80",
    "badge": ""
  },
  {
    "id": "honing-jointer-knife-tool",
    "name": "HONING JOINTER KNIFE TOOL",
    "imageUrl": "",
    "shortDescription": "Jointer Knives Honing Tool for H.S.S Knives  This simple hone tool lets you hone your jointer knives without having to remove them from the machine. Dip the hones in oil and make light, even strokes against the cutter head for perfect edges. The body holds the hones (180-400 grit aluminum oxide stone).  Indexed to the cutter head for perfect edges. A great tool for all jointer knives.",
    "badge": ""
  },
  {
    "id": "band-saw-14in-deluxe-craftex-cx-series-csa-cx104",
    "name": "BAND SAW 14\"DELUXE CRAFTEX CX SERIES",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this bandsaw and get a FREE in-depth Bandsaw course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase.  Click here for more info",
    "badge": ""
  },
  {
    "id": "digital-readout-for-planers-wixey",
    "name": "DIGITAL READOUT FOR PLANERS - WIXEY",
    "imageUrl": "",
    "shortDescription": "WIXEY DIGITAL READOUT IMPROVED VERSION  The Wixey Planer Digital Readout model WR510 has a new angled display for easy viewing as well as \"auto shut off.\" And like the WR500, it fits most portable woodworking planers.  It easily mounts to Craftex, DeWalt, Makita planer and others. It mounts in minutes and is calibrated in seconds.  It displays the thickness of the wood coming out the back of the planer in inches with fractions or millimeters.  Measuring Length: 6 in. (155mm) Resolution: Decimal = .005 in. Fraction = 1/32 in. Metric = 0.1 mm  Accuracy: Decimal = +/- .0025 in. Fraction = +/- 1/500 in. Metric = +/- .05 mm  Battery: type AAA (requires 2 x AAA batteries NOT INCLUDED)Functions: - Constant memory retains calibration even when OFF - Incremental measuring mode - Absolute measuring mode - Millimeter, Inch and Fraction readout - Auto shut off  Set Up It is easy to attach the Wixey Planer Digital Readout WR510 to your portable planer.It comes with simple mounting brackets and detailed instructions that allow you to mount this on many models without even drilling a single hole.  Calibrate Calibration takes only seconds with its patent pending calibration system. The WR510 Digital Readout uses a piece of freshly planed board to ensure the readout displays the exact thickness of wood coming out the back of your planer  Precise Measurements The large easy to read display reads in inches with fractions or millimeters. The fractions are displayed using \"Precise Fraction Technology\" which gives you 4 times the accuracy of other fraction readouts.  Easy to Use Once it is set up and calibrated, the WR510 consistently displays the thickness of wood coming out the back of your planer. It never needs re-calibrated unless the battery is re-placed or the blades get worn down. Advanced features let you \" zero the blade\" \"removed a precise amount of material\" , or \" measure the thickness of any board\"",
    "badge": ""
  },
  {
    "id": "face-plate-6in-1in-x-8-tpi",
    "name": "FACE PLATE 6\" 1\" X 8 TPI",
    "imageUrl": "",
    "shortDescription": "The B129018 Face Plate is a versatile and essential accessory for any wood lathe, offering a secure and stable mounting solution for a variety of turning projects. Designed with conveniently placed screw holes, this face plate allows for quick and easy workpiece attachment, making it ideal for bowl turning, spindle work, and other lathe applications. Additionally, it can be used as a sanding disc base, expanding its functionality in the workshop. Its durable construction ensures reliable performance, while the 1” x 8 TPI thread makes it compatible with a wide range of lathes.",
    "badge": ""
  },
  {
    "id": "belt-and-disc-sander-6-x-9-craftex-csa-cx-cx512",
    "name": "6\" X 9\" BELT & DISC SANDER",
    "imageUrl": "",
    "shortDescription": "6” x 9\" Belt and Disc Sander Combo Powered with a 1 HP 8 Amp motor this CX Series belt and disc sander is designed to give you versatility and performance. The 6” x 48” sanding belt operates horizontally (0-degree), vertically (90-degree) or at any angle in between. The 12” x 6” work table provides a solid work surface for sanding and tilts from 0-45 degree. Belt changing, tensioning and tracking all feature a quick release lever for effortless belt changes. The ON/OFF switch on CX512 features a removable locking pin as well as a 2” dust port for dust removal and a sturdy steel stand. FEATURES A precision aluminum table with miter gauge slot 2” Dust port for optimum dust removal Heavy duty stand  3 Year Warranty   SPECIFICATIONS Motor: 1-HP, 120-V, 60-Hz, Single Phase Amps: 8 Disc Diameter: 9” Disc Speed: 2510 RPM Belt Size: 6” x 48” Belt Speed: 1836 SFPM Work Table Size: 12” x 6” Work Table Tilt: 0 – 45 degree Sanding Belt Tilt: 0 - 90 degree Weight: 39 Kg",
    "badge": ""
  },
  {
    "id": "wood-vise-quick-release-7in-q",
    "name": "WOOD VISE QUICK RELEASE 7\" Q.",
    "imageUrl": "",
    "shortDescription": "The Quick Setting Woodworker's Vise is designed to provide optimal clamping performance for woodworking projects. Constructed with heavy-duty close grain cast iron, this vise ensures durability and long-lasting use. The handle and shafts are chrome plated, providing smooth operation and extended lifespan. Features  TOE-IN Feature: The jaws meet only at the top when fully closed, ensuring even clamping across the entire depth of the workpiece. Buttress Threads: The steel main screw is designed with buttress threads for smooth, accurate, and responsive adjustments. Wooden Liners: The body and sliding jaw have provisions for attaching wooden liners to protect the vise, workpiece, and tools.  Specifications  Jaw Width: 7\" Maximum Opening: 8\" Weight: 8.6 Kgs (19 lbs)  Comes With  Heavy-duty close grain cast iron jaws Chrome plated handle and shafts Steel main screw with buttress threads Provisions for attaching wooden liners (wooden liners not included)",
    "badge": ""
  },
  {
    "id": "10in-cabinet-saw-2hp-craftex-cx-series",
    "name": "10\" CABINET SAW 2HP",
    "imageUrl": "",
    "shortDescription": "CX212",
    "badge": ""
  },
  {
    "id": "centre-spur-mt-2",
    "name": "CENTRE SPUR MT 2 B1674",
    "imageUrl": "",
    "shortDescription": "The Centre Spur MT2 is a reliable and durable lathe accessory designed for woodturning. It securely holds workpieces in place, ensuring stability and precision during operation. Ideal for professional and hobbyist woodworkers, this spur center is compatible with wood lathes that use an MT2 (Morse Taper 2) spindle.",
    "badge": ""
  },
  {
    "id": "height-gauge-mini-wixey-digital",
    "name": "HEIGHT GAUGE MINI WIXEY DIGITAL",
    "imageUrl": "",
    "shortDescription": "WR25  Height Gauge Mini WIXEY  The large easy to read display reads in inches with fractions or millimetres. The fractions are displayed using \"Precise Fraction Technology\" which gives you 4 times the accuracy of other fraction readouts. The decimal inches are displayed in 0.002\" increments and the millimetres in 0.1mm increments.  SPECIFICATIONS  Measuring Height: 3\" (76mm) Measuring Depth: 2\" (51mm) Resolution: Decimal= 0.002\", Fraction= 1/32\", Metric= 0.05mm Accuracy: Decimal= +/-0.004\", Fraction= +/- 1/250\", Metric= +/-0.1mm Battery: Type CR2032 Functions: Inches, Millimetres, ON / OFF / ZERO, ABS / INC, Auto Shut Off",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-120g-4in-x-25ft-b2022120",
    "name": "SANDING PAPER ROLL 120G 4\" X 25FT B2022120",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Cloth Rolls 4\" x 25 FT.  Replacement rolls for the B2022 &amp; B2269 25\" Drum Sander. One 25' roll will cover both of the drums.  120 grit",
    "badge": ""
  },
  {
    "id": "10in-x90t-flawless-finish-blade-diablo",
    "name": "10\"X90T FLAWLESS FINISH BLADE DIABLO",
    "imageUrl": "",
    "shortDescription": "D1090X  10\" Ultra Fine 90 Teeth Circular Saw Blade for Wood and Wood Composites  For use with miter or table saws  Carbide construction  Ultra-thin kerf design for easy cuts  Shear-face grind design delivers effortless cuts with a reduced amp draw on tools for less material waste and to help maximize tool performance",
    "badge": ""
  },
  {
    "id": "front-vise-7in",
    "name": "FRONT VISE 7\"",
    "imageUrl": "",
    "shortDescription": "This 7\" Front Vise is the perfect addition for building a new workbench or upgrading an existing one. Its robust construction and user-friendly design make it an essential tool for any woodworking shop. Crafted from durable and strong close-grained cast iron, this vise ensures longevity and reliable performance. It features a spacious jaw size and high-capacity opening, making it versatile for various clamping needs. The vise is equipped with double guide rods and an Acme screw for smooth and precise operation, while the included wooden handle provides a comfortable grip for easy adjustments.",
    "badge": ""
  },
  {
    "id": "10in-wet-grinder-craftex-ct191",
    "name": "10\" WET GRINDER CT191",
    "imageUrl": "",
    "shortDescription": "CT191  10\" Wet Bench Grinder - Craftex  Sharpen just about any cutting tool with this 10\" wet bench grinder.   The CT191 features 1/4HP motor which rotates the wheel at a speed of 115 RPM, allows sharpening about any cutting tool in no time. The grinder has a water reservoir which prevents the sharp cutting edges from burning and keeps the grinding wheel clean and efficient. The universal support can be installed vertically or horizontally on the grinder and the grinding jig accepts a variety of cutting tools. The leather stropping wheel removes fine burrs and polishes the cutting edge to an unbelievable sharpness.  The CT191 comes with an angle guide, honning compound, universal support, grinding jig, 10\" grinding wheel, stropping wheel and a user manual.  SPECIFICATIONS  Motor: 1/4-HP, 120-Volts, Single Phase, 60-Hz Amps: 1.6 Amps Grinding Wheel Diameter: 10\" Grinding Wheel Thickness: 2\" Grinding Wheel Material: Aluminum Oxide Grinding Wheel Grit: 220 Arbor Diameter: 12mm (1/2\") Stropping Wheel Diameter: 8\" Stropping Wheel Thickness: 30mm (2\") Stropping Wheel Material: Leather Wheel Speed: 115 RPM Weight: 37 lbs Warranty: 2 Years",
    "badge": ""
  },
  {
    "id": "sanding-roll-120g-3in-x-83",
    "name": "SANDING ROLL 120G 3\" X 86\"",
    "imageUrl": "",
    "shortDescription": "CX509N120 SANDING ROLL 220G 3IN. X 83 120 Grit 3\" x 83 \" Sanding Paper Roll Sanding Paper Roll for 18\" Drum Sander Model CX509N  Grit: 120 Width: 3\" Length: 83\"",
    "badge": ""
  },
  {
    "id": "mitre-gauge-v27-incra",
    "name": "MITRE GAUGE V27 INCRA",
    "imageUrl": "",
    "shortDescription": "INCRA MITER GAUGE V27 The NEW Incra Miter V27 is engineered to provide a high performance, yet low cost upgrade for your Table Saw, Band Saw, Router Table, Disk Sander, Belt Sander or any other tool in need of a better miter gauge. Like all Incra Miter Gauges, the V27 delivers extreme miter cutting accuracy through the advanced combination of Incra's exclusive AngleLOCK indexing system and its patented Adjustable GlideLOCKMiter Bar. While the V27 delivers ALL of the accuracy of its bigger Incra Miter Gauge brothers, its no-nonsense design and compact size make it the most affordable Incra Miter Gauge EVER| Now, the Incra Miter V27 makes it possible to put an Incra Miter Gauge in EVERY standard miter channel in your shop. Great for use on your Bandsaw, Disc Sander or Router Table The Miter V27's compact protractor design works on applications typically not candidates for aftermarket gauges because of the narrow distance between the cutter and miter slot. Universal Mounting Bracket The Miter V27 Universal Mounting Bracket will support any user-made fence as well as any Incra fence. Specifications 1 - 27 positive angle stops 2 - GlideLOCK Miter Bar with 4 expansion points 3 - 5 degree increments 4 - Special stops at plus or minus 22 1/2 degree 5 - Plus or minus 60 degree range",
    "badge": ""
  },
  {
    "id": "miter-express-incra",
    "name": "MITER EXPRESS INCRA",
    "imageUrl": "",
    "shortDescription": "MITEREXPRESS  INCRA MITER GAUGE EXPRESS  The NEW Incra Miter Express Makes Safe and Easy Mitered Cuts  Incra's new Miter Express offers any miter gauge owner the safest and most accurate cross-cutting and mitering platform available.  Turn any miter gauge you own into a superior tool by simply docking it onto this sled. Shown above with an optional Incra Miter 1000SE mounted and ready, the Express features 2 embedded T-Slot channels to secure the included Hold Down Clamp and Outboard Fence Support. These slots are also invaluable for mounting your own custom Jigs and Fixtures. The fast \"Dock and Lock\" system securely locks your miter gauge in just seconds. It eliminates all side play with our patented miter channel expansion technology. Even the least expensive miter gauges will experience a tremendous performance boost when docked on top of the Miter Express.",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-120g-5-1-8in-x-7ft-9in",
    "name": "SANDING PAPER ROLL 120G 5 1/8\" X 7'9\"",
    "imageUrl": "",
    "shortDescription": "CX504120  120-Grit Sanding Paper for CX504  Replacement sanding paper for CX504 Drum Sander.",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-80g-4in-x-25ft-b202280",
    "name": "SANDING PAPER ROLL 80G 4\" X 25FT B202280",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Cloth Rolls 4\" x 25 FT.  Replacement rolls for the B2022 &amp; B2269 25\" Drum Sander. One 25' roll will cover both of the drums.  80 grit",
    "badge": ""
  },
  {
    "id": "sleeve-mt3-mt2",
    "name": "SLEEVE MT3/MT2",
    "imageUrl": "",
    "shortDescription": "R8 And Morse Taper Sleeves Hardened &amp; Ground Tool-Steel Precision drill sleeves to use Morse Taper tooling in R8 spindles or using smaller MT tooling in larger MT spindles| Taper reduction: From MT3 to MT2",
    "badge": ""
  },
  {
    "id": "switch-foot-115v-csa",
    "name": "ON OFF FOOT SWITCH FOR MACHINERY",
    "imageUrl": "",
    "shortDescription": "The B2855 On/Off Foot Switch is a practical and versatile solution for hands-free operation of workshop machinery and household equipment. Designed for efficiency and safety, this foot switch allows you to power tools like scroll saws, table saws, routers, and drill presses with ease. It can also be used for home applications, such as sewing machines. The switch engages power only when stepped on and automatically turns off when released, ensuring maximum control. Built to high standards, it is CSA-approved and manufactured in an ISO 9001-certified factory, offering reliability and peace of mind.",
    "badge": ""
  },
  {
    "id": "tape-measure-left-to-right-6-feet",
    "name": "6\" MEASURE TAPE LEFT TO RIGHT",
    "imageUrl": "",
    "shortDescription": "Optional Self Adhesive Tapes for model 2102  6' Left reading tape L-R",
    "badge": ""
  },
  {
    "id": "sanding-belt-4in-x-36in-120-grit",
    "name": "SANDING BELT 4\" X 36\" 120 GRIT",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 4” x 36”  Replacement belt for the CT094 Grit: 120",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr100",
    "name": "2\" X 28\" SANDING BELT 100 GRIT",
    "imageUrl": "",
    "shortDescription": "CT169100  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 100",
    "badge": ""
  },
  {
    "id": "sanding-belt-4in-x-36in-80-grit",
    "name": "SANDING BELT 4\" X 36\" 80 GRIT",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 4” x 36”  Replacement belt for the CT094 Grit: 80",
    "badge": ""
  },
  {
    "id": "magnetic-safety-push-stick-orange-color",
    "name": "MAGNETIC SAFETY PUSH STICK",
    "imageUrl": "",
    "shortDescription": "The B3484 Magnetic Safety Push Stick is designed to keep your hands safely away from table saw and jointer blades while providing secure control over your workpiece. Featuring two built-in magnets, it easily attaches to cast iron surfaces for convenient storage when not in use. The V-groove and notched end help hold the workpiece down firmly, ensuring greater accuracy and safety during operation.",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-60g",
    "name": "5\" SANDING DISC 10PC 60G",
    "imageUrl": "",
    "shortDescription": "These sanding discs are designed with resin bonded aluminum oxide grit, making them ideal for sanding wood, metal, and various surfaces like paint, fillers, primers, and more. Their hook and loop fastening system allows for quick and easy disc changes between different grits, maximizing efficiency during sanding tasks. These discs are specifically designed for sanders with 8-hole pads, providing effective dust extraction during use.",
    "badge": ""
  },
  {
    "id": "sanding-disc-5in-peel-and-stick-cloth-100g",
    "name": "SANDING DISC 5\" PEEL & STICK CLOTH 100G",
    "imageUrl": "",
    "shortDescription": "100-Grit, 5\" Peel and Stick Cloth Sanding Disc  This sanding disc uses tough Aluminum Oxide grain. Just peel the paper at the back of disc and stick it on the sander.  Grit: 100 Diameter: 5\"",
    "badge": ""
  },
  {
    "id": "dust-hood-2-1-2in-for-router-table",
    "name": "2.5\" ROUTER TABLE DUST HOOD",
    "imageUrl": "",
    "shortDescription": "Router Table Dust Hood With this hood you can complete your router  table  fence  for  dust collection feature. Fits a 2 1/2\" hose.",
    "badge": ""
  },
  {
    "id": "chuck-scroll-4-jaw-1in-x-8-tpi",
    "name": "4 JAW SCROLL CHUCK 1\" X 8 TPI",
    "imageUrl": "",
    "shortDescription": "The 4 Jaw Safety Scroll Chuck is designed to provide a secure and stable way to hold face plate work. This high-quality chuck is precision turned and built with a hardened body and jaws, ensuring durability and long-lasting performance. The black oxide finish adds an extra layer of protection against rust and wear. It is ideal for woodturners and metalworkers who need reliable holding power for various turning tasks.",
    "badge": ""
  },
  {
    "id": "disc-9in-80g",
    "name": "SANDING DISC 9\" 80G",
    "imageUrl": "",
    "shortDescription": "Bulk Discount: Buy 4 or more of the same grit for only $4.49 each. Simply add 4 or more of this item to your cart to qualify. Promotion valid until January 6th, 2023 80-Grit Aluminum Oxide Abrasive Disc  9\" Sanding Replacement Disc for the B318N  Grit: 80 Diameter: 9\"",
    "badge": ""
  },
  {
    "id": "router-bit-depth-gauge",
    "name": "ROUTER BIT DEPTH GAUGE",
    "imageUrl": "",
    "shortDescription": "The B1309 Router Bit Depth Gauge is an essential tool for woodworkers looking to achieve precise cutting depths without the guesswork. Designed for accuracy and ease of use, this gauge allows you to set and check router bit depths quickly and efficiently. Clearly marked in 16ths from 1/8\" to 1\", it enables you to achieve 15 precise depth settings without wasting time or material on trial and error. Whether you're routing a V-groove or working on intricate projects, this tool ensures consistent, professional results.",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr180",
    "name": "2\" X 28\" SANDING BELT 180 GRIT",
    "imageUrl": "",
    "shortDescription": "CT169180  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 180",
    "badge": ""
  },
  {
    "id": "deluxe-feather-board-with-t-slot-holder",
    "name": "DELUXE FEATHER BOARD WITH T SLOT HOLDER",
    "imageUrl": "",
    "shortDescription": "The B3260 Retrofit Featherboard Kit with T-slot Holder is a versatile and essential safety tool for improving precision and control during woodworking tasks. Designed for use with router tables, table saws, and band saws, this high-quality featherboard kit ensures that your workpiece stays firmly in place while reducing the risk of kickback. With two T-slot locking nuts and knobs, the featherboard quickly attaches to your working surface and stays securely locked when tightened. This kit is an excellent addition to any workshop, enhancing safety and accuracy.",
    "badge": ""
  },
  {
    "id": "saw-blade-lubricant-stick",
    "name": "SAW BLADE LUBRICANT STICK",
    "imageUrl": "",
    "shortDescription": "Saw Blade Lubricant Stick  This wax stick is specially compounded to keep metal, plastic and wood cutting blades from clogging because of chips or pitch. Smoother, quicker, cuts on metal, plastic or wood. Use on band, scroll, circular, hack or jeweler's saws. Round - 1\" x 8\" approx.",
    "badge": ""
  },
  {
    "id": "measuring-tape-12ft-self-adhesive-l-r-rdng",
    "name": "MEASURING TAPE 12'SELF-ADHESIVE,L-R RDNG",
    "imageUrl": "",
    "shortDescription": "KMS7724  1/2\" Wide Self Adhesive Measuring Tape - KREG TOOLS  This 1/2\" wide self adhesive measuring tape fits into the indentation on the top side of the Kreg Top Trak and Heavy Duty Track aluminum extrusions. Since the tape has self adhesive backing, it can be used anywhere. This metallic tape can be trimmed lengthwise using scissors and reads left to right.  Reading: Left to Right",
    "badge": ""
  },
  {
    "id": "disc-sanding-12in-120-grit",
    "name": "12\" SANDING DISC 120 GRIT",
    "imageUrl": "",
    "shortDescription": "120-Grit Aluminum Oxide Abrasive Disc 12\" Sanding Replacement Disc for the B023N &amp; B2193  Grit: 120 Diameter: 12\"",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-80g-5-1-8in-x-7ft-9in",
    "name": "SANDING PAPER ROLL 80G 5 1/8\" X 7'9\"",
    "imageUrl": "",
    "shortDescription": "CX50480  80-Grit Sanding Paper for CX504  Replacement sanding paper for CX504 Drum Sander.",
    "badge": ""
  },
  {
    "id": "2-1-2in-router-dust-port-dust-collection",
    "name": "2 1/2\" ROUTER PORT FOR DUST COLLECTION",
    "imageUrl": "",
    "shortDescription": "D42372-1/2\" Router Dust Port - WoodstockThis 2-1/4-inch Router Dust Port will collect chips and dust right at the router table.Specifications:Collect chips and dust right at the router tableEasily mounts to router table or shaper tablePort size measures 2-1/2\" ID and 2-11/16\" OD",
    "badge": ""
  },
  {
    "id": "sanding-disc-5in-peel-and-stick-cloth-120g",
    "name": "SANDING DISC 5\" PEEL & STICK CLOTH 120G",
    "imageUrl": "",
    "shortDescription": "120-Grit, 5\" Peel and Stick Cloth Sanding Disc  This sanding disc uses tough Aluminum Oxide grain. Just peel the paper at the back of disc and stick it on the sander.  Grit: 120 Diameter: 5\"",
    "badge": ""
  },
  {
    "id": "t-bolts-1-4in-20-x-2-1-4in-10pc-set",
    "name": "T-BOLTS 1/4\" - 20 X 2 1/4\" 10PC/SET",
    "imageUrl": "",
    "shortDescription": "The B2493214 T-Bolts are designed for versatility and reliability in woodworking and metalworking applications. Made from copper-plated brass, these T-bolts are perfect for securing jigs, fixtures, and fences in T-slots, providing a strong and stable connection. With a precise design and durable construction, they are an essential addition to any workshop.",
    "badge": ""
  },
  {
    "id": "pepper-grinder",
    "name": "PEPPER GRINDER",
    "imageUrl": "",
    "shortDescription": "B3537 Antique Style Hand Crank Pepper Grinder Kit Mechanism Have you ever wanted to turn a traditional pepper mill but have been fearful of the process involved in creating one? Now you can with our Antique Hand Crank Pepper Grinder, a simple and straightforward turning kit! Simply use any 3\" x 3\" wood blank by whatever length you desire your grinder to be, mark the center and drill a 1\"-diameter hole through the center of the blank to allow the pepper to pass through. Mount the blank between centers by utilizing a jamb chuck. Next turn to your desired profile, sand, finish, and attach the grinder to the top of your turned piece. Now you have a one-of-a-kind antique looking pepper grinder. Grinder mechanism measures 2\" in diameter x 4-3/8\" tall and features an Antique Copper finish, cast metal parts, and a finial that adjusts for coarse to fine granules.   Smooth operating cast metal parts Simple and fun to create Antique Copper finish Finial adjusts to allow for coarse or fine granules",
    "badge": ""
  },
  {
    "id": "disc-sanding-12in-100-grit",
    "name": "12\" SANDING DISC 100 GRIT",
    "imageUrl": "",
    "shortDescription": "100-Grit Aluminum Oxide Abrasive Disc 12\" Sanding Replacement Disc for the B023N &amp; B2193  Grit: 100 Diameter: 12\"",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-100g-b3970",
    "name": "5\" SANDING DISC 10PC 100G B3970",
    "imageUrl": "",
    "shortDescription": "These sanding discs feature a resin-bonded aluminum oxide grit, ideal for both wood and metal applications. They are also well-suited for sanding paint, fillers, primers, and more, making them versatile tools in your sanding toolkit. The quick-change hook and loop fastening system simplifies the process of switching between different grits, ensuring a seamless workflow. Designed for use with sanders that have 8-hole pads, these discs are 5 inches in diameter. Each package contains 10 discs, providing ample supply for various projects.",
    "badge": ""
  },
  {
    "id": "5in-sanding-disc-10pc-40g",
    "name": "5\" SANDING DISC 10PC 40G",
    "imageUrl": "",
    "shortDescription": "These 5\" sanding discs are designed with a resin-bonded aluminum oxide grit, making them suitable for a variety of applications, including sanding wood, metal, paint, fillers, primers, and more. The discs are ideal for both heavy-duty sanding and finer finishing tasks. The quick-change, hook and loop fastening system ensures easy switching between different grit levels, making your sanding projects more efficient. Each disc is crafted to fit sanders with 8-hole pads, allowing for optimal dust extraction and smoother sanding results.",
    "badge": ""
  },
  {
    "id": "scroll-saw-20in-cw-stand-and-light-dewalt",
    "name": "SCROLL SAW 20\" CW STAND AND LIGHT DEWALT",
    "imageUrl": "",
    "shortDescription": "DW788BS  20\" Variable Speed Scroll Saw Plus BONUS Stand &amp; Lamp - DEWALT  FEATURES  Up front controls Electronic variable speed Multi-directional dust blower Tool-less blade change Uses plain pin less blades Ratcheting tension lever Permanent magnet motor Heavy Duty Stand Handy Work Lamp  SPECIFICATIONS  Motor: 1.3 amps, 400-1750 SPM Stroke length: 3/4\" Table 16\" x 24\": 45-Degree right and left Throat: 20\" Height capacity: 2\" Weight: 43 Kgs Carton Size: 12\" x 19 1/2\" x 29 1/2\" Optional stand available",
    "badge": ""
  },
  {
    "id": "disc-9in-120g",
    "name": "SANDING DISC 9\" 120G",
    "imageUrl": "",
    "shortDescription": "Bulk Discount: Buy 4 or more of the same grit for only $4.49 each. Simply add 4 or more of this item to your cart to qualify. Promotion valid until January 6th, 2023120-Grit Aluminum Oxide Abrasive Disc  9\" Sanding Replacement Disc for the B318N  Grit: 120 Diameter: 9\"",
    "badge": ""
  },
  {
    "id": "planer-blades-16in-4-pc-set-for-b325",
    "name": "PLANER BLADES 16\" 4 PC SET FOR B325",
    "imageUrl": "",
    "shortDescription": "Extra Blades for Model B1981 16\" Thickness Planer Quantity: 4pc Set Size: 16\" x 1\" x 1/8\" H.S.S.",
    "badge": ""
  },
  {
    "id": "sanding-belt-1in-x-30in-100g",
    "name": "SANDING BELT 1\" X 30\" 100G",
    "imageUrl": "",
    "shortDescription": "B130R100 Aluminum Oxide Abrasive Belt 1\" X 30\" Sanding Belt. Grit: 100",
    "badge": ""
  },
  {
    "id": "universal-featherboard-mag-switch",
    "name": "UNIVERSAL FEATHERBOARD - MAG SWITCH",
    "imageUrl": "",
    "shortDescription": "B3028  Universal Feather Board - MAG SWITCH  Works On Both Sides Of The Blade, And Even The Fence. Low profile and double sided, this is the ultimate featherboard from Magswitch. Works to improve your cutting results on either side of the blade.   Also designed to work on any cast-iron fence to hold down your work so you don't have to.",
    "badge": ""
  },
  {
    "id": "sanding-roll-80g-3in-x-83",
    "name": "SANDING ROLL 80G 3\" X 86\"",
    "imageUrl": "",
    "shortDescription": "CX509N080 SANDING ROLL 220G 3IN. X 83 80 Grit 3\" x 83 \" Sanding Paper Roll Sanding Paper Roll for 18\" Drum Sander Model CX509N  Grit: 80 Width: 3\" Length: 83\"",
    "badge": ""
  },
  {
    "id": "large-spray-shelter",
    "name": "LARGE SPRAY SHELTER",
    "imageUrl": "",
    "shortDescription": "The Spray Shelter is a tent-like structure that provides a large, safe area to spray paint or stain, and protects your surrounding area from overspray drift. It can be used with aerosol cans, airless paint sprayers, or HVLP sprayers like the Finish Max or Super Finish Max. Use with a drop cloth recommended (not included). Stakes provided to secure shelter to the ground 9 ft. wide x 6 ft. Deep x 5.5 ft. High. Features: Provides a large, safe area to spray paint or stainPortable and lightweight for easy maneuveringProtects surrounding area form overspray Specifications: Depth: 6 ft.Width: 9 ft.Height: 5.5 ft.Weight: 2.93 Kg (6.45 lbs)",
    "badge": ""
  },
  {
    "id": "wood-lathe-with-digital-readout-csa-cx803",
    "name": "14\" X 43\" VARI SPEED WOOD LATHE",
    "imageUrl": "",
    "shortDescription": "CX803 14\" x 43\", 3/4HP Wood Lathe - Craftex CX-Series Equipped with a 3/4 HP motor, this 14\" x 43\" wood lathe can swing 14\" over bed and features variable spindle speed ranges from 600 to 2400 RPM. The 43\" distance between the centers and the variable speed gives you the flexibility for any project and the solid cant iron bed construction dampens any stock vibration, resulting in greater precision.  Other features of the CX803 include a digital RPM display, MT2 spindle table, 6\" face plate, cast iron stand and cast iron tailstock.   SPECIFICATION  Motor: 3/4HP, 120V, Single Phase Number of Speeds: Variable Speed Spindle Taper: MT2 Spindle Size: 1\" x 8 TPI Swing Over Bed: 14\" (355mm) Distance Between Centers: 43\" (1100mm) Spindle Speed Ranges: Variable, 600 - 2400 RPM Tailstock Taper: MT2 Tailstock Spindle Travel: 2-1/4\" (57mm) Faceplate Size: 6\" (152mm) Bed Construction: Precision Ground Cast Iron Stand Construction: Cast Iron Headstock Construction: Cast Iron Tailstock Construction: Cast Iron Digital RPM Display: Yes Overall Length: 63\" (1600mm) Approx Weight: 281 lbs (128 Kg) Warranty: 3 Years",
    "badge": ""
  },
  {
    "id": "feather-board-twin-pack-kreg",
    "name": "FEATHER BOARD TWIN PACK - KREG",
    "imageUrl": "",
    "shortDescription": "KREG Feather Board Twin Pack  The True-FLEXO Feather Board gets its name from the careful engineering that went into its design. Many featherboards on the market today apply too much pressure or not enough pressure to the workpiece, resulting in imperfect cuts and less than safe operation. Designed with each finger of the True-FLEXO featherboard to provide a consistent and optimum pressure, and to stand up to years of use in your woodshop. The featherboard is made from an extremely durable plastic composite body and even includes an exclusive wedge-lock system which allows the featherboard to be secured to a variety of shop tools without the need for additional hardware. Whether you're using a miter-slot or a t-slot, working on a table saw or a router table, the wedge-lock system adjusts accordingly and lets you work with confidence",
    "badge": ""
  },
  {
    "id": "sanding-belt-6-x-48-100g",
    "name": "SANDING BELT 6 X 48 100G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 6” x 48”  Replacement belt for the B318N, B023N &amp; B2193 Grit: 100",
    "badge": ""
  },
  {
    "id": "measuring-tape-12ft-self-adhesive-r-l-rdng",
    "name": "MEASURING TAPE 12'SELF-ADHESIVE,R-L RDNG",
    "imageUrl": "",
    "shortDescription": "KMS7723  1/2\" Wide Self Adhesive Measuring Tape - KREG TOOLS  This 1/2\" wide self adhesive measuring tape fits into the indentation on the top side of the Kreg Top Trak and Heavy Duty Track aluminum extrusions. Since the tape has self adhesive backing, it can be used anywhere. This metallic tape can be trimmed lengthwise using scissors and reads right to left.  Reading: Right to Left",
    "badge": ""
  },
  {
    "id": "planer-blades-20in-4pc-set",
    "name": "PLANER BLADES 20\" 4PC SET",
    "imageUrl": "",
    "shortDescription": "Extra Blades 4pc Set H.S.S. for Model B705Blade Dimensions: 20” x 1” x 1/8”",
    "badge": ""
  },
  {
    "id": "brake-cartridge-for-10in-blades-saw-stop",
    "name": "CARTRIDGE BRAKE FOR 10\" BLADES SAW STOP",
    "imageUrl": "",
    "shortDescription": "SawStop standard 10\" brake cartridge TSBC-10R2 for use with SawStop industrial, contractor, and professional table saws (not compatible with older CB model saws).",
    "badge": ""
  },
  {
    "id": "disc-sanding-12in-60-grit",
    "name": "12\" SANDING DISC 60 GRIT",
    "imageUrl": "",
    "shortDescription": "60-Grit Aluminum Oxide Abrasive Disc 12\" Sanding Replacement Disc for the B023N &amp; B2193  Grit: 60 Diameter: 12\"",
    "badge": ""
  },
  {
    "id": "blade-101in-x-3-4in-x-032-x-3tpi",
    "name": "BANDSAW BLADE 101\" X 3/4\" X .032 X 3TPI",
    "imageUrl": "",
    "shortDescription": "ÿþC X 1 0 4 0 3 4",
    "badge": ""
  },
  {
    "id": "steady-rest-for-wood-lathe",
    "name": "STEADY REST FOR WOOD LATHE",
    "imageUrl": "",
    "shortDescription": "The Steady Rest for Wood Lathe is a robust and reliable accessory designed to provide extra support and stability while turning workpieces on a wood lathe. Made from solid cast iron, this steady rest ensures durability and long-lasting performance. It is equipped with 3/4\" sealed ball bearings for smooth operation and precise alignment, making it an ideal tool for achieving accurate and consistent results in your woodturning projects. This steady rest is suitable for use with 12\" and 14\" lathes, accommodating workpieces with an approximate capacity of 3 1/2\" in diameter.",
    "badge": ""
  },
  {
    "id": "blade-93-1-2in-x-1-4in-6t-skip-tooth",
    "name": "BANDSAW BLADE 93 1/2\" X 1/4\" 6T SKIP TOO",
    "imageUrl": "",
    "shortDescription": "Band Saw Blade for Model B227N 14\" Band Saw Skip Tooth Length: 93 1/2\" Width: 1/4\" Pitch: 6 Skip Gauge: .025\"",
    "badge": ""
  },
  {
    "id": "live-centre-mt3",
    "name": "LIVE CENTRE MT3",
    "imageUrl": "",
    "shortDescription": "The Precision Live Centres – MT3 are designed for high accuracy and durability. These live centres are essential for precision machining tasks, ensuring stability and reliability during operations. Ideal for use in lathes, they are built to withstand rigorous working conditions while maintaining high performance.",
    "badge": ""
  },
  {
    "id": "angle-plate-4-5in",
    "name": "ANGLE PLATE 4.5\"",
    "imageUrl": "",
    "shortDescription": "The B987 Angle Plate is a precision-machined tool designed to provide stability and accuracy for machining, drilling, and alignment tasks. Made from high-quality slotted cast iron with a machine finish, this compact angle plate is a versatile addition to any workshop. Its robust design ensures long-lasting performance while offering flexibility for securing workpieces in a variety of positions.",
    "badge": ""
  },
  {
    "id": "sanding-belt-6-x-48-120g",
    "name": "SANDING BELT 6 X 48 120G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 6” x 48”  Replacement belt for the B318N, B023N &amp; B2193 Grit: 120",
    "badge": ""
  },
  {
    "id": "feather-board-double",
    "name": "FEATHER BOARD DOUBLE MILESCRAFT",
    "imageUrl": "",
    "shortDescription": "1407  Double Tandem Feather Board  Great for table saws &amp; router tables this tool is ideal for dual applications. Can be used as 1 piece or 2. Two feather boards ¾\" &amp; 5/8\" miter bars and T-slot bolts Includes spacer for tandem use Dual slide motion for quick &amp; easy set up Split rail metal miter bars for maximum hold Pre-Load tension design  -  Quickly set consistent tension and reduce kickback Ergonomic knobs help prevent over-tightening and provide non-slip loosening High visibility yellow for added safety Mounting hardware included",
    "badge": ""
  },
  {
    "id": "switch-safety-f-power-tool-120v-10a-max",
    "name": "SAFETY POWER TOOL SWITCH 120V 12 AMP",
    "imageUrl": "",
    "shortDescription": "The B2487 Safety Switch is designed to provide a safe and convenient way to connect portable power tools to a table, such as a router table or mitre saw stand. With a 10 Amp rating at 115V, this switch ensures reliable operation and enhances the safety of your woodworking or DIY projects by offering an accessible power control solution.",
    "badge": ""
  },
  {
    "id": "disc-9in-100g",
    "name": "SANDING DISC 9\" 100G",
    "imageUrl": "",
    "shortDescription": "Bulk Discount: Buy 4 or more of the same grit for only $4.49 each. Simply add 4 or more of this item to your cart to qualify. Promotion valid until January 6th, 2023 100-Grit Aluminum Oxide Abrasive Disc  9\" Sanding Replacement Disc for the B318N  Grit: 100 Diameter: 9\"",
    "badge": ""
  },
  {
    "id": "overarm-blade-guard-system-cx-series-cxarm",
    "name": "OVERARM BLADE GUARD SYSTEM CX-SERIES CXARM",
    "imageUrl": "",
    "shortDescription": "CXARM   Over Arm Blade Guard System Craftex CX-Series  Add safety and dust collection to your table saw with this Over Arm Blade Guard.  This floor standing unit will fit just about any table saw and comes with an extra support bracket that will bolt directly to your table saw base. It works easily with 4” dust collection hose and you can quickly position the over arm guard in and out thanks to the quick pivoting action.  Ideal for use with table saws with riving knives/splitters or with an anti kickback device.  Recommended for use with 4” hose &amp; with dust collector 600CFM &amp; up.  FEATURES   Collects small dust and chips thrown into the air with each cut Quick Pivot action Solid steel base construction Clear blade guard for added visibility 6 1/2” vertical adjustment for guard Mounting bracket for unit to table saw Fully adjustable – will work with any table saw Comes complete with nothing extra to purchase  Height of arm (bottom of arm to floor) 46” – 48 3/4\" Length of arm (from inside column to center of guard) 37” – 65\" Length of base mount to inside of column 46” – 54”  Made in Taiwan",
    "badge": ""
  },
  {
    "id": "16in-variable-speed-scroll-saw",
    "name": "16\" VARIABLE SPEED SCROLL SAW",
    "imageUrl": "",
    "shortDescription": "The all new CX126 Variable Speed Scroll Saw is not your run of the mill Scroll Saw, packed with great features such as Variable-speed blade control, extra-large cutting capacity and cast-iron construction which are the most sought after features in a Scroll Saw. The CX126 Scroll Saw offers all these features and a gooseneck work light, dust port, large 45° tilt table and easy blade change mechanism. The CX126 is backed by our 3 year warranty. Uses plain and pin-end saw blades. Features Accepts both pin and pinless bladesThroat depth of 16”Tilting tableEquipped with a flexible goose neck work lightEquipped with dust bower to keep workpiece clear of debris Specifications: Motor: 120V,60Hz, 1.2AVariable Speed: 50-1600 SPMThroat Depth: 16”Blade Type: 5” pinned &amp; pin-lessBlade Stroke: 9/16”Cutting Capacity: 2” @ 90°Table Tilt: 0°to 45° LeftMax cutting thickness: 2\"Max. cutting width: 16\"Overall Dimensions: 26-3/8”x 13” x 14-3/4”Shipping Dimensions: 26-1/4”x 13”x 14.5”Weight: 12.5Kg (27.5 lbs.) Warranty: 3 Years",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr060",
    "name": "2\" X 28\" SANDING BELT 60 GRIT",
    "imageUrl": "",
    "shortDescription": "CT16960  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 60",
    "badge": ""
  },
  {
    "id": "10in-drill-press-with-led-light-craftex-c-cx616",
    "name": "10\" DRILL PRESS WITH LED",
    "imageUrl": "",
    "shortDescription": "CX616  The CX616 10\" Bench Top Drill Press is welcome addition to a small shop.  Features 5 different speeds setting that can be manually set by adjusting the drive belt and pulley's located on top of the unit. This unit comes well equipped with a strong induction motor suitable for heavier jobs and built in LED work light for better visibility while working. The CX616 is also equipped with standard rack and pinion table height adjustments and a solid cast iron base just like our bigger floor model drill presses yet more compact and suitable for use on top of your workbench to help save space in your shop.  Features:  5 Speeds Powerful 1/2HP Motor Table Tilts 45 degree right and left  Rack &amp; Pinion Table height Adjustment  Cast Iron Base for added stability  LED work light    Specifications: Motor: 1/2HP , 120V/60hz, 3.2A Drill Speed: 620-2800 Chuck Type: JT33 Chuck Size: 1/2\" Spindle Taper: JT33 Spindle Travel: 1.969\" Max Distance spindle to table: 16.142\" Tilting Table: 45 degrees left &amp; right Weight: 21.5kg 3 Year Warranty",
    "badge": ""
  },
  {
    "id": "chisel-set-deluxe-hss-for-lathe-6pcs",
    "name": "CHISEL SET DELUXE HSS FOR LATHE 6PCS",
    "imageUrl": "",
    "shortDescription": "D2304  6 Pc. Deluxe HSS Lathe Chisel Set  For serious wood turners, this Deluxe Lathe Chisel Set features beefy ash handles for unsurpassed control, brass ferrules and high speed steel blades. Includes: 15/16\" x 17\" Parting Tool, 13/16\" x 17\" Round Nose and 3/8\" x 19\" Long Bowl Gouge; 1\" x 17\" Skew, a 5/8\" x 22-1/2\" Roughing Gouge and a 3/8\" x 19\" Spingle Gouge.  Specifications: 15/16\" Parting Tool - 17\" Long 13/16\" Round Nose - 17\" Long 3/8\" Long Bowl Gouge - 19\" Long 1\" Skew - 17\" Long 5/8\" Roughing Gouge - 22-1/2\" Long 3/8\" Spindle Gouge - 19\" Long HSS Ash Handles",
    "badge": ""
  },
  {
    "id": "clamp-hold-down-for-b2935",
    "name": "HOLD DOWN CLAMP FOR WOODWORKING",
    "imageUrl": "",
    "shortDescription": "Hold Down Clamp for B2935 Drill Press Table is designed to secure your workpiece tightly to the table, ensuring precise and accurate drilling. This clamp is an essential accessory for enhancing the functionality of your drill press.",
    "badge": ""
  },
  {
    "id": "sanding-roll-220g-3in-x-83",
    "name": "SANDING ROLL 220G 3\" X 86\"",
    "imageUrl": "",
    "shortDescription": "CX509N220 SANDING ROLL 220G 3IN. X 83 220 Grit 3\" x 83 \" Sanding Paper Roll Sanding Paper Roll for 18\" Drum Sander Model CX509N  Grit: 220 Width: 3\" Length: 83\"",
    "badge": ""
  },
  {
    "id": "trend-tool-and-bit-cleaner-18fl-oz-532ml",
    "name": "TREND TOOL AND BIT CLEANER 18FL OZ 532ML",
    "imageUrl": "",
    "shortDescription": "B3229  532ml Tool Cleaner - TREND  Spray-on resin and pitch remover. Simply spray on wipe off.  Ideal for sawblades, router cutters, planer blades, files, wrenches and drill bits etc. Excellent lubricant. Provides rust and corrosion protection. Has unique properties which break the molecular bond and lifts the dirt from the tool as opposed to eating away the dirt like citrus cleaners and other chemicals. Industrial strength cleaner that increases tool life. Biodegradable and user friendly. Non-toxic and non-flammable. Supplied in pump action dispenser.  Size: 532ml",
    "badge": ""
  },
  {
    "id": "sign-pro-sign-making-jig-milescraft",
    "name": "SIGN PRO SIGN MAKING JIG MILESCRAFT",
    "imageUrl": "",
    "shortDescription": "New Sign Pro - MilesCraft The Sign Pro has the improved features of Sign Crafter and is by far MilesCraft's best sign making jig. Easily create up to 36\" long signs that are professional looking and less time consuming. To increase the stability, the sturdier rails are designed in such a way that it touches the work surface and the end caps can be firmly clamped. It comes with 2 low profile C-Clamps that allow the router base to pass unobstructed and the Turn Lock Bushings are metal nose. It includes over 200 self spacing durable polymer blend templates and includes-1/4\" and 3/8\" tungsten carbide tipped core box router bits This kit includes everything you need to get started: carbide tipped router bits, metal-nose guide bushings, special low-profile C-clamps, self-spacing number, letter and punctuation templates and more.",
    "badge": ""
  },
  {
    "id": "urethane-tire-for-14in-bandsaws-pair",
    "name": "URETHANE TIRE FOR 14\" BANDSAWS PAIR",
    "imageUrl": "",
    "shortDescription": "Replace worn out bandsaw tires for improved performance. Fits most 14\" bandsaw wheels from various brands.Easy installation and sold in a pair for added value. Includes 2 x 14” Urethane Bandsaw tires",
    "badge": ""
  },
  {
    "id": "scraper-cabinet-6in-sorby",
    "name": "SCRAPER CABINET 6\" SORBY",
    "imageUrl": "",
    "shortDescription": "Cabinet Scrapers - \"Robert Sorby\" Rect. 6\" x 3\" Made of the finest steel. Cabinet scrapers, when properly sharpened and burnished produce a finish not available with either a plane or sandpaper. Invaluable to the cabinetmaker.",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-100g-4in-x-25ft-b2022100",
    "name": "SANDING PAPER ROLL 100G 4\" X 25FT B2022100",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Cloth Rolls 4\" x 25 FT.  Replacement rolls for the B2022 &amp; B2269 25\" Drum Sander. One 25' roll will cover both of the drums.  100 grit",
    "badge": ""
  },
  {
    "id": "salad-bowl-finish-claphams-8-oz",
    "name": "SALAD BOWL FINISH CLAPHAMS 7 OZ.",
    "imageUrl": "",
    "shortDescription": "B158909 8 Oz Beeswax Salad Bowl Finish Finish - CLAPHAM'S Our food-grade Beeswax/Carnauba/Mineral oil finish is suitable for all things wooden in the kitchen. The finish protects the wood and gives it a soft lustrous shine. It is suitable for salad bowls, butcher blocks, cutting boards, wooden spoons, kitchen counter tops- both wood and stone, and also children’s wooden toys and cribs. Apply the finish thinly with your hand, cloth or paper towel. It may take some time to dry depending on the temperature and humidity of your home or workshop, but the piece can be used immediately. When dry, buff to a light shine and enjoy. Re-apply when the piece looks dry.",
    "badge": ""
  },
  {
    "id": "rust-remover-evaporust-1l",
    "name": "RUST REMOVER EVAPORUST 1L",
    "imageUrl": "",
    "shortDescription": "Rust Remover - EVAPO-RUST 1 Liter A product of extensive research, EVAPO-RUST rust remover is an environmentally-safe water-based product that removes rust in minutes, without scrubbing. It's so easy to use, anyone can restore their rusted tools, auto parts, even firearms to like-new condition. One gallon de-rusts up to 300 lbs. of steel. Names to R &amp; D Magazines Top 100 Inventions of the year 2000. Removes even heavy rust completely Non-toxic, non-corrosive, safe on skin No fumes or bad odors, non-flammable, no VOC's Biodegradable, water soluble Easy to use - Soak part in room temperature solution Requires no special equipment No acids, bases, solvents or other toxic ingredients Will not harm unrusted steel, safe on other metals Can be disposed of safely into sewer One gallon derusts up to 300 pounds of heavily rusted steel Will not affect plastic, PVC, Viton and most paints Size - 1 Liter",
    "badge": ""
  },
  {
    "id": "track-t-24in-alluminum-with-2-hold-down",
    "name": "24\" ALUMINUM T TRACK WITH 2 HOLD DOWNS",
    "imageUrl": "",
    "shortDescription": "The 24\" Aluminum T-Track Set With 2 Hold-Downs is a versatile tool designed for creating custom jigs, positioners, and hold-downs, saving you valuable set-up time in your workshop. This set includes a 24\" aluminum T-track and two adjustable hold-downs that securely position and clamp workpieces. Each hold-down comes with a knob and a 1/4\"-20 sliding bolt, and is adjustable to work with materials up to 2 1/2\" thick, providing flexibility for a variety of woodworking projects.",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-120g-3in-x-96in",
    "name": "SANDING PAPER ROLL 120G 3\" X 91\"",
    "imageUrl": "",
    "shortDescription": "CX507120  120 Grit 3\" x 91\" Sanding Paper Roll  Sanding Paper Roll for 16\" Drum Sander Model CX507  Grit:120 Width: 3\" Length: 91\"",
    "badge": ""
  },
  {
    "id": "12in-x100t-flawless-finish-blade-diablo",
    "name": "12\"X100T FLAWLESS FINISH BLADE DIABLO",
    "imageUrl": "",
    "shortDescription": "D12100X  12\", 100 Tooth Diablo Ultra Fine Circular Saw Blade for Wood and Wood Composites   For use with miter saws  Shear-face grind design delivers effortless cuts with a reduced amp draw on tools for less material waste and to help maximize tool performance  Laser-cut stabilizer vents trap noise and vibration and stabilizes the blade",
    "badge": ""
  },
  {
    "id": "6in-x-48in-sanding-belt-3pc-80g",
    "name": "6\" X 48\" SANDING BELT 3PC 80G",
    "imageUrl": "",
    "shortDescription": "These sanding belts are well-made with aluminum oxide grit, resin-bonded to an X-weight cloth backing. They perform well for general-purpose use in materials like wood, plastic, and metal.",
    "badge": ""
  },
  {
    "id": "scroll-saw-16in-var-speed-makita",
    "name": "SCROLL SAW 16\" VAR SPEED MAKITA",
    "imageUrl": "",
    "shortDescription": "The Makita 16\" Variable Speed Scroll Saw is a precision tool designed for intricate woodworking tasks. Engineered for both professionals and hobbyists, this scroll saw features a versatile variable speed control that allows for precise cutting in a wide range of materials. Its robust build and user-friendly design ensure smooth operation, making it ideal for detailed and delicate cuts. Whether working on complex patterns or simple designs, this scroll saw delivers consistent performance and control.",
    "badge": ""
  },
  {
    "id": "sanding-disc-5in-peel-and-stick-cloth-180g",
    "name": "SANDING DISC 5\" PEEL & STICK CLOTH 180G",
    "imageUrl": "",
    "shortDescription": "180-Grit, 5\" Peel and Stick Cloth Sanding Disc  This sanding disc uses tough Aluminum Oxide grain. Just peel the paper at the back of disc and stick it on the sander.  Grit: 180 Diameter: 5\"",
    "badge": ""
  },
  {
    "id": "customizable-mobile-base",
    "name": "CUSTOMIZABLE MOBILE BASE",
    "imageUrl": "",
    "shortDescription": "The Customizable Mobile Base is an essential addition to any workshop, allowing you to create mobile bases tailored to fit any machine weighing up to 500 lbs. Designed for versatility and ease of use, this kit can be paired with plywood ranging from ½\" to 1\" thick. The mobile base is equipped with four rugged wheels, making it simple to maneuver your machinery when not in use. This solution optimizes workspace efficiency by enabling easy movement and storage of heavy equipment.",
    "badge": ""
  },
  {
    "id": "depth-gauge-milescraft",
    "name": "DEPTH GAUGE MILESCRAFT",
    "imageUrl": "",
    "shortDescription": "8601  Depth Gauge Milescraft  Quickly and accurately locate and/or measure and mark blade and bit heights, and fence offsets.  Depth Gauge Features:  Durable metal scale measures in inches or millimeters Metal locking knob Wide base with sturdy feet Straddles most table saw throats for measuring while adjusting. Self standing  -  Allows a depth to be set while bringing the blade or bit up to the desired level",
    "badge": ""
  },
  {
    "id": "tapering-jig-for-table-saws-24in",
    "name": "TAPERING JIG FOR TABLE SAWS 24\"",
    "imageUrl": "",
    "shortDescription": "This Taper Jig is designed for precision and durability, featuring a robust aluminum construction and a built-in scale for accurate adjustments. Fully adjustable and equipped with a backside stop, it securely holds your material in place during operation. The jig can be set up for either right or left-hand use, making it versatile and user-friendly. With a 3\" taper per foot and a generous overall length of 24\", this jig allows for precise taper cuts up to 15 degrees, perfect for your woodworking projects.",
    "badge": ""
  },
  {
    "id": "2hp-2-gal-silent-hot-dog-compressor",
    "name": "1.60 GAL 0.65 HP ULTRA QUIET COMPRESSOR B3837",
    "imageUrl": "",
    "shortDescription": "This ultra quiet compressor is a great addition to any shop or on the go contractor’s arsenal of tools. This small yet powerful unit boasts a 0.65 HP 110V 5.5 Amp motor that runs at a surprisingly low noise level of 48 dB. Equipped with a regulated pressure so you can set the desired pressure for whatever the operation requires. This is also an oil free unit which means no maintenance will be required for upkeep. Description:  1.6 Gal Air Compressor Ultra Quiet   Low noise, only 48 dB Oil free, no maintenance needed Regulated pressure gauge Industrial M-style coupler Metal air filter   Specifications: Motor: 0.65 HP, 110 V / 60 Hz,  5.5 Amp Noise: 48 dB Tank capacity: 1.6 Gal CFM at 90 PSI: 1.3 CFM RPM: 1400 Weight: 15 Kg / 33 lbs",
    "badge": ""
  },
  {
    "id": "sanding-roll-100g-3in-x-86in",
    "name": "SANDING ROLL 100G 3\"X 86\"",
    "imageUrl": "",
    "shortDescription": "CX509N100 SANDING ROLL 220G 3IN. X 83 100 Grit 3\" x 83 \" Sanding Paper Roll Sanding Paper Roll for 18\" Drum Sander Model CX509N  Grit: 100 Width: 3\" Length: 83\"",
    "badge": ""
  },
  {
    "id": "bench-top-router-table-with-stand",
    "name": "BENCH TOP ROUTER TABLE WITH STAND B2944BT",
    "imageUrl": "",
    "shortDescription": "This heavy-duty gauge steel stand provides a stable platform for the 16\" x 24\" Bench Top Router Table and Fence. Designed for durability and stability, this stand ensures your router table remains steady during all your woodworking projects. When mounted to this 20\" wide x 15\" deep x 13-1/2\" tall steel stand, the table top will be 14-1/2\" above your workbench, providing a comfortable working height. The unit comes equipped with a 3/8\" router insert plate for versatile routing capabilities.",
    "badge": ""
  },
  {
    "id": "router-plunge-base-for-dcw600b-dewalt",
    "name": "ROUTER PLUNGE BASE FOR DCW600B DEWALT",
    "imageUrl": "",
    "shortDescription": "The DNP612 heavy-duty Plunge Base for Compact Router features a clear, Lexan base for enhanced base durability and rubber overmolded handles and low center of gravity design for comfort, balance, and control.   Features:  Adjustable, tool-free steel motor cam lock makes depth adjustment and base changes quick and solid-locking. Precision machined brass bushings and case-hardened steel guide rods provide a smooth and accurate plunge stroke. Clear, LEXAN sub-base provides enhanced base durability, bit visibility, and accepts standard template guide bushings. Rubber overmolded handles and low center of gravity design provide best-in-class comfort, balance, and control. Heavy-duty, precision machined, die-cast aluminum base and motor housing for durability and low tool weight. Five position, adjustable turret stop assists in stepped or repeated plunge cuts. Micro-fine depth adjustment on plunge base 5/128\" per turn for precise routing in veneer and inlays. Easy to reach plunge lever and switch for superior control while routing.",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-80g-3in-x-96in",
    "name": "SANDING PAPER ROLL 80G 3\" X 91\"",
    "imageUrl": "",
    "shortDescription": "CX507080  120 Grit 3\" x 91\" Sanding Paper Roll  Sanding Paper Roll for 16\" Drum Sander Model CX507  Grit:80 Width: 3\" Length: 91\"",
    "badge": ""
  },
  {
    "id": "bench-screw-for-work-bench-vise",
    "name": "BENCH SCREW FOR WORK BENCH VISE",
    "imageUrl": "",
    "shortDescription": "The 16\" Bench Screw is a robust component designed to help you build your own custom vise. It features a 1 1/8\" Acme threaded steel shaft, providing 13\" of smooth travel for efficient clamping operations. The rugged cast iron fittings come pre-drilled with holes for secure attachment to both the workbench and the movable jaw of the vise. Additionally, a 1\" diameter hole is included to accommodate the handle, making it easy to operate.",
    "badge": ""
  },
  {
    "id": "10-pcs-brass-router-bushing-sets",
    "name": "10 PCS BRASS ROUTER BUSHING SETS",
    "imageUrl": "",
    "shortDescription": "",
    "badge": ""
  },
  {
    "id": "10in-x-24t-ripping-blade-diablo",
    "name": "10\" X 24T RIPPING BLADE DIABLO",
    "imageUrl": "",
    "shortDescription": "D1024X  10\", 24-Tooth ATB Ripping Saw Blade  Laser cut stabilizer vents trap noise and vibration keeping it cool and reducing blade warp  Laser cut heat expansion slots allow blade to expand due to heat build-up keeping the cut true and straight  Durable micro grain titanium carbide for extreme durability, razor-sharp cuts, and long life  Tri-metal shock resistant brazing allows carbide tips to withstand extreme impact for maximum durability  Laser cut arbor for accurate blade rotation reducing vibration and premature wear",
    "badge": ""
  },
  {
    "id": "turnerns-mesh-sanding-pack",
    "name": "TURNERS MESH SANDING PACK",
    "imageUrl": "",
    "shortDescription": "Turners Mesh Abrasive Rolls are designed for efficient sanding projects on your lathe. Each abrasive strip features tiny holes that allow wood particles to pass through, preventing the abrasive surface from clogging. This makes the strips ideal for sanding rounded shapes such as spindles, vases, and bowls. The flexible material easily conforms to various shapes, ensuring a smooth finish.",
    "badge": ""
  },
  {
    "id": "semi-pro-2-stage-gravity-system-fuji",
    "name": "SEMI PRO 2 STAGE GRAVITY SYSTEM FUJI",
    "imageUrl": "",
    "shortDescription": "2203G - Semi-Pro2with Gravity Feed Spray Gun (7002G M-Model Gravity Spray Gun)  The Semi-Pro 2 is the perfect HVLP spray system for serious DYR-ers and semi-professionals.  Powerful 1400 watt motor provides enough power to spray all coatings, develops approximately 5psi. Durable metal turbine case sits on 4 rubber feet, with a modular power cord. Full length 25ft Hi-Flex hose includes air control valve to reduce over spray to a minimum. Brass quick-connect coupler for gun to hose connection. The turbine also features a handy gun stand. No other HVLP system in this price range comes even close to matching the quality and features of the Semi-Pro 2Gravity system.  Turbine Dimensions: 11\" x 8.6\" x 8.1\" / Metric Dimensions: 28cm x 22cm x 20.5cm  System Weight: 12.35lbs / 5.6Kg 7002G M-Model Gravity Spray Gun has all the professional features: Non-bleed spray gun for less blowing around of shop dust and over spray  Dedicated Fan Pattern Control to adjust the fan size from small and circular to large vertical or horizontal fan Stay Cool Handle- nylon-coatedhandle always stays cool even after long periods of spraying 400cc gravity cup 1.3mm Aircap Set installed Easy to clean and comfortable to use 2-year warranty on all parts and labour  WEIGHT: 25.2lb/ 11.43kg DIMENSIONS: 16.5 x 14 X 15.5 inches / 42 x 35.5 x 38.5 cm",
    "badge": ""
  },
  {
    "id": "long-safety-push-stick",
    "name": "LONG SAFETY PUSH STICK",
    "imageUrl": "",
    "shortDescription": "The B3261 Large Safety Push Stick is an essential safety tool for any workshop. Designed to keep your hands at a safe distance from cutting tools, this push stick ensures maximum protection and precision during operation. Built with strong, rigid plastic, it offers durability and reliability for use with table saws, router tables, jointers, and other cutting machines. Its ergonomic design and built-in hanger make it a practical, easy-to-use addition to your workshop.",
    "badge": ""
  },
  {
    "id": "6in-x-48in-sanding-belt-3pc-120g",
    "name": "6\" X 48\" SANDING BELT 3PC 120G",
    "imageUrl": "",
    "shortDescription": "These sanding belts are constructed with high-quality aluminum oxide grit, resin-bonded to an X-weight cloth backing. They are designed for general purpose use, providing excellent performance on materials such as wood, plastic, and metal. Ideal for both professional and DIY projects, these belts ensure durability and efficiency in various sanding applications.",
    "badge": ""
  },
  {
    "id": "push-pad-extra-long",
    "name": "EXTRA LONG SAFETY PUSH PAD",
    "imageUrl": "",
    "shortDescription": "The B3104 Extra Long Safety Push Pad is designed to provide enhanced control and safety when working with table saws, jointers, routers, and other woodworking machinery. Made from strong ABS plastic, this 16\" long and 2-3/4\" wide push pad offers a comfortable grip while keeping hands safely away from cutting blades.",
    "badge": ""
  },
  {
    "id": "emery-cloth-roll-180-grit",
    "name": "EMERY CLOTH ROLL 180 GRIT",
    "imageUrl": "",
    "shortDescription": "Emery Cloth Roll 180 Grit  A popular abrasive among woodworkers, tradesmen and hobbyists in the workshop, this emery cloth roll is water resistant and ideal for fine finishes. More flexible and durable then regular sandpaper, this works great on metals. Size - 15 ft x 1 1/2\" Grit - 180",
    "badge": ""
  },
  {
    "id": "vise-cross-sliding-5in",
    "name": "5\" CROSS SLIDING VISE",
    "imageUrl": "",
    "shortDescription": "The Vise Cross Sliding 5\" is a versatile and precise tool designed to enhance your milling, drilling, and other machining operations. This cross-sliding vise allows for smooth and accurate horizontal and vertical movement of the workpiece, enabling precise positioning without the need to reposition the vise itself. With a robust 5-inch jaw width, this vise securely holds workpieces in place, ensuring stability and precision during machining tasks. Its durable construction and easy-to-adjust screws make it an essential addition to any workshop. Features:  Cross-sliding design for precise horizontal and vertical positioning. 5-inch jaw width for securely holding various workpieces. Smooth adjustment screws for easy and accurate positioning. Durable construction ensures long-lasting performance. Ideal for milling, drilling, and other precision machining tasks.  Specifications:  Type: Cross Sliding Vise Overall Height 6\" Base measure 6 1/2\" x 10 1/2\" Width of jaws 5\" Opening of jaws 4 3/4\" Bottom slide travel 6 1/2\" Top slide travel 51/2\"  Comes With:  Vise Cross Sliding 5\".",
    "badge": ""
  },
  {
    "id": "jointer-6in-1hp-w-open-stand-csa-craftex-ct086",
    "name": "JOINTER 6\" 1HP W/OPEN STAND CSA CRAFTEX CT086",
    "imageUrl": "",
    "shortDescription": "EXCLUSIVE OFFER - Purchase this Jointer and get a FREE in-depth Jointer course covering over 2 hours of performance optimization, accessories, troubleshooting, and more. You will be emailed a link to the course after purchase. Click here for more info",
    "badge": ""
  },
  {
    "id": "angle-strap-clamp-variable-bessey-vas232k",
    "name": "BESSEY ANGLE STRAP CLAMP VARIABLE VAS232K",
    "imageUrl": "",
    "shortDescription": "VAS232K  This angle strap clamp, with its various angles and swiveling pressure plates, provides infinite angle adaptability and continuous high pressure on all mitered corners and tightens automatically as it clamps. The specially woven polyester strap guarantees high-tensile strength (up to 1,100-pounds) with almost no stretch. The strap also features reciprocal gears, is easy to fix at any position, and has a clamping capacity of 23-feet. The set includes one clamp and four angle plates.   FEATURES Even pressure on mitre joints High quality strap clamp Comes with 4 pivoting vario corners Clamping Capacity: up to 23 feet  Range of Angle: 60 -180 degrees   SPECIFICATIONS Band Material: Polyster Frame Material: Glass filled Nylone Application Clamping and Compressing Irregularly Shaped Objects Band Width: 1\" Overall Length: 7-1/2\" Number of Jaws:  Four Band Length: 23 Feet Jaw Width: 1\"",
    "badge": ""
  },
  {
    "id": "glue-mate-450-milescraft",
    "name": "GLUE MATE 450 MILESCRAFT",
    "imageUrl": "",
    "shortDescription": "The GlueMate450™ by Milescraft is the perfect glue accessory for everyone. From master craftsmen to first-time DIY’ers, this 15oz. advanced glue bottle makes for quick and accurate application. The large size holds enough glue to be your everyday go-to gluing solution. The secret is the two-chamber design. When pressure is applied the glue is sent from the bottom of the storage chamber up through the smaller application chamber. This allows you to control the flow and deliver just the amount of glue you need. It even allows for vertical application – you can put glue anywhere, at any angle! Included with the GlueMate450™ are 2 different application tips. A fine point cone applicator allows you to lay down a fine bead of glue on narrow boards or in dowel holes or other joints. The flat biscuit applicator tip has a wide profile making it great for biscuit joints, or just spreading a wider bead of glue on bigger boards. Features: Double chamber system allows for gluing at any angleNarrow application tube helps you control flow and apply precise amounts of glue2x applicator tips for different occasionsFine cone Applicator for fine beadsFlat biscuit Applicator for wide flat beadsHolds 15 oz. of wood glue or other liquidsFill with your favorite brand of glue! Specifications: Bottle Size: 15 oz. (450 ml) Non Drip Tips Included: Dowel Applicator Tip + CapBiscuit/Domino Applicator Tip + Cap",
    "badge": ""
  },
  {
    "id": "aluminum-miter-track-36in",
    "name": "36\" ALUMINUM MITER T TRACK",
    "imageUrl": "",
    "shortDescription": "The B3263 Aluminum Miter Track is a versatile and durable 36-inch miter track designed to fit standard 3/4\" x 3/8\" miter gauges, with or without a T-slot. It offers smooth sliding for precise adjustments, making it ideal for various woodworking applications. This track is compatible with different tools, including table saws, drill press tables, band saw tables, and table saw extensions, enhancing their functionality and accuracy. The B3263 miter track is crafted from high-quality aluminum, ensuring long-lasting performance and reliability. It also comes with 5 pre-drilled holes for easy and secure mounting, saving you installation time.",
    "badge": ""
  },
  {
    "id": "blade-101in-x-1-4in-x-025-x-6tpi-cx104014",
    "name": "BANDSAW BLADE 101\" X 1/4\" X .025 X 6TPI CX104014",
    "imageUrl": "",
    "shortDescription": "ÿþC X 1 0 4 0 1 4",
    "badge": ""
  },
  {
    "id": "router-table-w-fence-only-b2594",
    "name": "ROUTER TABLE WITH FENCE",
    "imageUrl": "",
    "shortDescription": "Router Table With Fence  This router table can handle it all. The table measures 27\" x 23 1/2\" x 1 3/8\" and comes with a 3/4\" mitre track and fence track already installed. There is a custom fit table insert 12\" x 9\" x 3/8\" with removable insert rings so you can use large bits. The split fence design gives you two 12\" x 6\" x 1\" MDF fence extensions with T-track installed. The fence extensions are attached to a 24\" x 3\" x 3\" aluminum fence.",
    "badge": ""
  },
  {
    "id": "arbor-mt2-j33",
    "name": "ARBOR MT2/J33",
    "imageUrl": "",
    "shortDescription": "The Arbor MT2 J33 is a high-precision tool designed for securely mounting drill chucks with a J33 taper onto machines equipped with an MT2 spindle. This reliable arbor ensures a stable and accurate connection, making it ideal for drilling and machining tasks that require precision and consistency. Built to withstand rigorous use, it provides smooth operation with minimal runout, delivering reliable performance in a variety of metalworking applications. Features:  Securely mounts drill chucks with a J33 taper. Compatible with machines featuring an MT2 spindle. Provides precise alignment for accurate drilling operations. Reduces runout for enhanced machining precision. Durable construction for long-lasting performance.  Specifications:  Taper: MT2 to J33  Comes With:  Arbor MT2 J33.",
    "badge": ""
  },
  {
    "id": "sanding-drum-set",
    "name": "SANDING DRUM SET",
    "imageUrl": "",
    "shortDescription": "B455 25 pc Sanding Drum Set Rubber drum size: 1/2\" x 1/2\", 3/4\" x 1\", 1\" x 1\", 1-1/2\" x 1-1/2\", 2\" x 1-1/2\"  Abrasive sleeves: 2 sets of fine (120 g) 2 sets of coarse (80 g) In blow moulded case",
    "badge": ""
  },
  {
    "id": "sanding-belt-4in-x-36in-100-grit",
    "name": "SANDING BELT 4\" X 36\" 100 GRIT",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 4” x 36”  Replacement belt for the CT094 Grit: 100",
    "badge": ""
  },
  {
    "id": "boseshield-rust-free-spray-8oz",
    "name": "BOESHIELD RUST FREE SPRAY 8OZ",
    "imageUrl": "",
    "shortDescription": "B3708 Use RustFree  to quickly remove rust and corrosion from any surface including steel and cast iron bench power tool tops and metals hand tools. Available in an 8oz spray bottle.",
    "badge": ""
  },
  {
    "id": "feather-pro-featherboard-bow",
    "name": "FEATHER PRO FEATHER BOARD BOW",
    "imageUrl": "",
    "shortDescription": "B3679 The FeatherPro Featherboard developed by Bow Products is a game changer in woodworking tools. Sure you might read that and think that sounds like a lot of hype, but we've got the stats and the features to back it up. Just take a look at some of the features this featherboard provides below, as well as our videos to the left. Currently the FeatherPro fits any table with a 3/8\" x 3/4\" Miter slot. The product ships with aluminum miter bars.  Features: ANTI-KICKBACK LIVING HINGE DESIGN - The FeatherPRO's patented hinge absorbs energy and substantially reduces or arrests the chance of kickback. EASIER / SMOOTHER GLIDE ON INFEED VERSUS PLASTIC OR WOOD FEATHERBOARDS - This is especially true when applying higher pressure. VIBRATION RESISTANCE - You'll achieve higher quality cuts because the feathers absorb vibration so well.  EASIER GLIDE + VIBRATION RESISTANCE = IMPROVED OUTFEED MATERIAL CONTROL - Minimize chatter marks.  HARDENED FOAM FEATHERS - These are especially beneficial if they come in contact with Carbide Blades or Router Bits. Greatly reduces or even avoids shattering the Blade or Bit. Translates to improved safety to woodworkers avoiding shattered material debris. Saves the Blade or Bit.  INTERCHANGEABLE FEATHERS - If you ever make a mistake we've got you covered. Our patented feather design easily swaps out if they ever become damaged.  NON-MARRING FEATHERS - You can apply lots of pressure or a little pressure depending on what you're doing EVEN WHEN working with soft woods! You'll never use a wood or plastic featherboard again.  VERSATILE - You don't need a left and a right. The FeatherPro is reversible by simply flipping it over and reversing hardware. You can also use it in the vertical position, not just horizontal.",
    "badge": ""
  },
  {
    "id": "carbide-inserts-for-helical-cutterheads",
    "name": "CARBIDE CUTTERS 15MM X 15MM X 2.5MM 10PC",
    "imageUrl": "",
    "shortDescription": "10pc/Pack Carbide Insert for Helical Cutterhead Machines - Craftex CX-Series These high quality carbide inserts are used with our helical cutterhead machines giving smoother and superior finish compared to the Spiral Version  Quantity: 10 pcs / Pack     IMPORTANT CXHCINS will fit all machines listed in the chart below. INSERT SIZE 15 X 15 X2.5MM     BRAND   MODEL#   DESCRIPTION     Crafex CX-Series   CX06BTSC   Jointer 6” with Spiral cutterhead     Crafex CX-Series   CX06HC   Jointer 6” with helical cutterhead     Crafex CX-Series   CX08HC   Jointer 8\" with helical cutterhead     Crafex CX-Series   CX12HC   Jointer 12\" with helical cutterhead     Crafex CX-Series   CX15HC   Planer 15\" with helical cutterhead     Crafex CX-Series   CX20HC   Planer 20\" with helical cutterhead     GRIZZLY   G0834   12\" 5hp Jointer with spiral cutterhead     GRIZZLY   G0821   6\" Benchtop jointer with spiral cutterhead     STEELEX   ST1011   8” Jointer with helical-style cutterhead     STEELEX   ST1012   15\" Planer with helical-style cutterhead     STEELEX   ST1013   12\" Jointer with helical-style cutterhead     STEELEX   ST1014   20\" Planer with helical-style cutterhead     RIKON   25210H   12” Jointer Planer Combination Machine",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-100g-5-1-8in-x-7ft-9in",
    "name": "SANDING PAPER ROLL 100G 5 1/8\" X 7'9\"",
    "imageUrl": "",
    "shortDescription": "CX504100  100-Grit Sanding Paper for CX504  Replacement sanding paper for CX504 Drum Sander.",
    "badge": ""
  },
  {
    "id": "disc-sanding-12in-150-grit",
    "name": "12\" SANDING DISC 150 GRIT",
    "imageUrl": "",
    "shortDescription": "150-Grit Aluminum Oxide Abrasive Disc 12\" Sanding Replacement Disc for the B023N &amp; B2193  Grit: 150 Diameter: 12\"",
    "badge": ""
  },
  {
    "id": "chuck-key-1-2in-5-8in",
    "name": "CHUCK KEY 1/2\" - 5/8\"",
    "imageUrl": "",
    "shortDescription": "The B194412 Spring Eject Chuck Key is designed to enhance safety by automatically ejecting after use, reducing the risk of leaving the key in the drill chuck. This spring-loaded safety key is ideal for workshops, schools, and training environments where safety is a top priority. It fits drill chucks ranging from 1/2\" to 5/8\", making it a versatile and essential tool for any drilling operation.",
    "badge": ""
  },
  {
    "id": "sanding-roll-150g-3in-x-83",
    "name": "SANDING ROLL 150G 3\" X 86\"",
    "imageUrl": "",
    "shortDescription": "CX509N150 SANDING ROLL 220G 3IN. X 83 150 Grit 3\" x 83 \" Sanding Paper Roll Sanding Paper Roll for 18\" Drum Sander Model CX509N  Grit: 150 Width: 3\" Length: 83\"",
    "badge": ""
  },
  {
    "id": "mitre-slide-24in-incra",
    "name": "MITRE SLIDE 24\" INCRA",
    "imageUrl": "",
    "shortDescription": "INCRA MITER SLIDER 24\"  This long aluminum runner adjusts from the TOP for perfect sliding action in any standard 3/4\" x 3/8\" miter gauge slot. Won't warp, shrink, or swell like wooden runners.  - A simple turn of a screw adjust Miter Slider for ZERO sideplay. Another turn locks it securely in place for stationary jigs such as feather boards.  - Includes FREE illustrated plans for using a wide variety of shop-made jigs and fixtures like the miter jig shown in the photo.  Incra Miter Sliders Make Great Shop Jigs Easy Crosscut Box: This crosscut box firmly supports the stock off the table surface for a smooth cut, while maintaining a perfectly square cut.  Miter Jig: This miter jig guarantees accurate and repeatable 45 degree cuts without the inconvenience of setting up a miter gauge, tilting the blade, or trial and error cuts.  Feather Board: This feather board locks in the miter slot to push the stock firmly against the rip fence",
    "badge": ""
  },
  {
    "id": "sorby-turnmaster-with-3-carbide-cutters",
    "name": "SORBY TURNMASTER WITH 3 CARBIDE CUTTERS",
    "imageUrl": "",
    "shortDescription": "RSTMHCT123  TurnMaster Handled with Detail Point, Round and Square Tungsten Carbide Cutters - Robert Sorby  FEATURES:  3 Tungsten Carbide Cutters; Detail Point, Round and Square All cutters interchangeable with one tool Indexable, patented cutting head for shear scraping Interchangeable cutter head, No need to buy whole new tool Flat underside for stability High tensile Torx screw/ key for quick cutter release 525mm (20 5/8\") in length   ABOUT TurnMaster  The Robert Sorby TurnMaster is the first tool in the world to combine three cutting edge technologies in one flexible tool. Cutters are available in tungsten carbide, titanium nitride (TiN) and high speed steel (HSS) providing unsurpassed range to woodturners at every level. The RSTMHCT123 comes with Tungsten Carbide cutters.  An unprecedented collection of parts and cutters make it the most versatile and value added single tool concept on the market today. Among its many features TurnMaster incorporates a patented interchangeable cutter head that locks into three positions allowing for simple scraping and shear scraping options.",
    "badge": ""
  },
  {
    "id": "heavy-duty-bench-top-wood-lathe-stand",
    "name": "HEAVY DUTY BENCH TOP WOOD LATHE STAND CXWLSTAND",
    "imageUrl": "",
    "shortDescription": "CXWLSTAND Ever want to clear up work bench space? Now you can by turning your bench top wood lathe into a standalone machine allowing you to relocate it from the bench to a better suited area in your shop leaving the work bench free for other tasks like glue ups and assembly. If your bench top lathe is equipped with a bed extension no problem as there is the CXWLSTANDEXT that can be purchased separately to support your lathe and bed extension. Specifications: Height Range: 24 ½” – 34” Mounting Pattern Range: 18 ½” x 4” – 38 ½” x 6 ½” Weight Capacity: 220 lbs",
    "badge": ""
  },
  {
    "id": "sanding-sleeves-150g-4-1-2in-6pc",
    "name": "SANDING SLEEVES 150G 4 1/2\" 6PC",
    "imageUrl": "",
    "shortDescription": "CX508150 These 4-1/2\" Sanding Sleeves are replacement sanding sleeves for CX508 Sander. Includes the following sizes (diameters): 1/2\", 3/4\", 1\", 1 1/2\", 2\", 3\" 150 Grit Qty: 6",
    "badge": ""
  },
  {
    "id": "belt-2-x-28-gr040",
    "name": "2\" X 28\" SANDING BELT 40 GRIT",
    "imageUrl": "",
    "shortDescription": "CT16940  2\" x 28\" Belt for CT169N Sander  2\"  Width x 28\" Length  Grit: 40",
    "badge": ""
  },
  {
    "id": "table-vise-2in",
    "name": "TABLE VISE 2\"",
    "imageUrl": "",
    "shortDescription": "The B9862 Groz 2-inch Clamp-On Table Vise is a compact and durable tool designed for light-duty clamping applications. Made from high-grade cast iron, it provides excellent stability and strength. The integrated clamp allows for a firm and secure grip on workbenches, tables, and other surfaces, making it ideal for hobbyists, craftsmen, and small workshop tasks. The chrome-plated handle and bar ensure smooth operation and resistance to wear.",
    "badge": ""
  },
  {
    "id": "blade-guide-bearing-2pc-for-15in-16in-saw",
    "name": "BLADE GUIDE BEARING 2PC FOR 15\" 16\" BAND",
    "imageUrl": "",
    "shortDescription": "The \"Ball Bearing\" Band Saw Blade Guides are designed for use with 14 1/2\" band saws. This 2-piece set provides support both above and below the table, ensuring optimal performance and precision during cutting operations. The guides feature cast iron brackets that support 1 1/8\" sealed ball bearings and are cam adjusted for exact fitting. These guides fit 7/8\" diameter upper blade supports and are designed for long life adjustment, contributing to a longer blade life.",
    "badge": ""
  },
  {
    "id": "arbor-mt2-j6",
    "name": "ARBOR MT2/J6",
    "imageUrl": "",
    "shortDescription": "The Arbor MT2 J6 is a high-precision tool designed to ensure secure mounting of drill chucks with a J6 taper onto machines with an MT2 spindle. Engineered for accuracy and durability, this arbor is a reliable choice for professional drilling and machining tasks. Its precise taper alignment minimizes runout and ensures consistent performance, making it ideal for metalworking, woodworking, and other demanding applications.",
    "badge": ""
  },
  {
    "id": "sanding-roll-180g-3in-x-83",
    "name": "SANDING ROLL 180G 3\" X 86\"",
    "imageUrl": "",
    "shortDescription": "CX509N180 SANDING ROLL 220G 3IN. X 83 180 Grit 3\" x 83 \" Sanding Paper Roll Sanding Paper Roll for 18\" Drum Sander Model CX509N  Grit: 180 Width: 3\" Length: 83\"",
    "badge": ""
  },
  {
    "id": "lathe-wood-14in-x-40in-4spd-1-2hp-craftex-ct083",
    "name": "14\" X 40\" WOOD LATHE 1/2HP",
    "imageUrl": "",
    "shortDescription": "14\" x 40\" Wood Turning Lathe, 1/2 HP  An Excellent Lathe For Beginners Square Steel Tubular Ways  A complete basic wood lathe, pressed steel base with square tubular ways, cast iron headstock, tailstock and tool rest.  Features Motor: 1/2 HP, 110V, 1 Phase Max. length: 40\" Max. Diameter: 14\" Spindle\" 1\" - 8 TPI Speeds: 4 - 760 - 2240 RPM Gross Weight: 35kg.. Carton size: 9\" x 14 1/2\" x 58\"  Standard Equipment Motor Cross slide 12\" tool rest 6\" face plate Spur centre Ball bearing centre  2 Year Warranty",
    "badge": ""
  },
  {
    "id": "arbor-mt3-jt3",
    "name": "ARBOR MT3/JT3",
    "imageUrl": "",
    "shortDescription": "The B113 Drill Chuck Arbor is a high-precision tool designed for securely mounting drill chucks onto machine spindles. Made from precision-hardened and ground tool steel, it ensures durability, accuracy, and long-lasting performance. This arbor features an MT3 (Morse Taper 3) to JT3 (Jacobs Taper 3) configuration, making it ideal for drill presses, lathes, and milling machines requiring a reliable chuck mounting solution.",
    "badge": ""
  },
  {
    "id": "mitre-slide-18in-incra",
    "name": "MITRE SLIDE 18\" INCRA",
    "imageUrl": "",
    "shortDescription": "INCRA MITER SLIDER 18\"  This long aluminum runner adjusts from the TOP for perfect sliding action in any standard 3/4\" x 3/8\" miter gauge slot. Won't warp, shrink, or swell like wooden runners.  - A simple turn of a screw adjust Miter Slider for ZERO sideplay. Another turn locks it securely in place for stationary jigs such as feather boards.  - Includes FREE illustrated plans for using a wide variety of shop-made jigs and fixtures like the miter jig shown in the photo.  Incra Miter Sliders Make Great Shop Jigs Easy Crosscut Box: This crosscut box firmly supports the stock off the table surface for a smooth cut, while maintaining a perfectly square cut.  Miter Jig: This miter jig guarantees accurate and repeatable 45 degree cuts without the inconvenience of setting up a miter gauge, tilting the blade, or trial and error cuts.  Feather Board: This feather board locks in the miter slot to push the stock firmly against the rip fence",
    "badge": ""
  },
  {
    "id": "track-t-alluminum-36in-with-2-hold-down",
    "name": "36\" ALUMINUM T TRACK WITH 2 HOLD DOWNS",
    "imageUrl": "",
    "shortDescription": "The 36\" Aluminum T-Track Set with 2 Hold-Downs is designed to streamline your workshop setup, allowing you to create custom jigs, positioners, and hold-downs for various tasks. This versatile set helps reduce set-up time and increases precision for woodworking, metalworking, and other projects. Each set includes one durable aluminum track and two adjustable hold-downs, complete with knobs and sliding bolts. The hold-downs accommodate materials up to 2 1/2\" thick, offering secure clamping and easy adjustment for a wide range of applications.",
    "badge": ""
  },
  {
    "id": "sanding-belt-6-x-48-60g",
    "name": "SANDING BELT 6 X 48 60G",
    "imageUrl": "",
    "shortDescription": "Aluminum Oxide Abrasive Belt 6” x 48”  Replacement belt for the B318N, B023N &amp; B2193 Grit: 60",
    "badge": ""
  },
  {
    "id": "face-plate-6in-3-4in-x-16-tpi",
    "name": "FACE PLATE 6\" 3/4\" X 16 TPI",
    "imageUrl": "",
    "shortDescription": "Face Plates For Wood Lathe Very Popular| Here is another item that is very handy for use on wood lathes. The feature conveniently placed screw holes. Make excellent sanding discs.  Size: 6\" Thread: 3/4\" x 16 TPI Weight: .4kg",
    "badge": ""
  },
  {
    "id": "sanding-disc-5in-peel-and-stick-cloth-150g",
    "name": "SANDING DISC 5\" PEEL & STICK CLOTH 150G",
    "imageUrl": "",
    "shortDescription": "150-Grit, 5\" Peel and Stick Cloth Sanding Disc  This sanding disc uses tough Aluminum Oxide grain. Just peel the paper at the back of disc and stick it on the sander.  Grit: 150 Diameter: 5\"",
    "badge": ""
  },
  {
    "id": "stand-tool-13in-x-23in-capacity-700lb",
    "name": "STAND - TOOL 13\" X 23\" CAPACITY-700LB D2056",
    "imageUrl": "",
    "shortDescription": "D2056 Tool Stand  Flared legs and adjustable feet ensure stability and reduce machine vibration. Butcher block finish table top measures 13\" x 23\".  Height: 30 ½\" Capacity: 700 lbs.",
    "badge": ""
  },
  {
    "id": "sanding-paper-roll-150g-5-1-8in-x-7ft-9in",
    "name": "SANDING PAPER ROLL 150G 5 1/8\" X 7'9\"",
    "imageUrl": "",
    "shortDescription": "CX504150  150-Grit Sanding Paper for CX504  Replacement sanding paper for CX504 Drum Sander.",
    "badge": ""
  },
  {
    "id": "sanding-disc-5in-peel-and-stick-cloth-220g",
    "name": "SANDING DISC 5\" PEEL & STICK CLOTH 220G",
    "imageUrl": "",
    "shortDescription": "220-Grit, 5\" Peel and Stick Cloth Sanding Disc  This sanding disc uses tough Aluminum Oxide grain. Just peel the paper at the back of disc and stick it on the sander.  Grit: 220 Diameter: 5\"",
    "badge": ""
  },
  {
    "id": "dust-hood-for-jointer-8-1-2in-x-10-1-4in",
    "name": "JOINTER DUST HOOD 8 1/2\" X 10 1/4\" FOR D",
    "imageUrl": "",
    "shortDescription": "Jointer Flange 4\" Plastic - 8 1/2\" x 10 1/4\" - For Dust Collector &amp; Jointers",
    "badge": ""
  },
  {
    "id": "sleeve-mt2-mt1",
    "name": "SLEEVE MT2/MT1",
    "imageUrl": "",
    "shortDescription": "R8 And Morse Taper Sleeves - From MT2 to MT1 Hardened &amp; Ground Tool-Steel Precision drill sleeves to use Morse Taper tooling in R8 spindles or using smaller MT tooling in larger MT spindles| Taper reduction: From MT2 to MT1",
    "badge": ""
  },
  {
    "id": "freud-8in-stacked-dado-set-for-all-saws",
    "name": "FREUD 8\" STACKED DADO SET FOR ALL SAWS",
    "imageUrl": "",
    "shortDescription": "Freud’s new SD208S 8” Stacked Dado Set has a true 8” diameter and an optimized blade design for premium performance on all safety brake equipped and underpowered saws. This dado set delivers chip and splinter free flat bottomed grooves in plywood, melamine and solid wood. The SD208S is compatible with all saws including Saw Stop, Jet, Dewalt, Bosch, and more. It produces grooves ranging in sizes from 1/4\" to 7/8”.   Features:   The set includes 2 blades, 3 chippers, spacers and a shim set for micro adjustability Ideal for flat bottom grooves ranging in sizes from 1/4\" to 7/8\" in laminated plywood, melamine and solid wood. Optimized blade design for premium performance on all safety brake equipped and underpowered saws including Saw Stop, Jet, Dewalt, Bosch, and more. Features Premium TiCo™ HI-Density Carbide Crosscutting Blend for Maximum Performance Silver I.C.E. Coating prevents build up on the blade surface and keeps the blade running cooler and cleaner.   Specifications:   Blade Diameter: 8” Dado Range: 1/4'' to 13/16'' in 1/16'' increments Tip Material: TiCo High-density Carbide Max RPM: 6000 Tooth Count (outer blades): 12 Arbor Size: 5/8''",
    "badge": ""
  },
  {
    "id": "helical-cutters-14-3-x-14-3-x-2mm-10pc",
    "name": "HELICAL CUTTERS 14.3 X 14.3 X 2MM 10PC CXHCINS2",
    "imageUrl": "",
    "shortDescription": "10pc/Pack Insert for Helical Cutterhead Machines - Craftex CX-SeriesThese high quality H.S.S cutter inserts are used with our CX125HC Bench Top Helical Planer and our CX08HTHC Bench Top Helical Jointer machines giving smoother and superior finish compared to straight knife cutters.",
    "badge": ""
  },
  {
    "id": "rikon-111in-x-1-4in-025-6-tpi-skip-blade",
    "name": "BANDSAW BLADE 111\" X 1/4\" 025 6 TPI SKIP 191100",
    "imageUrl": "",
    "shortDescription": "191100  111\" x 1/4\" 025 6 TPI Hook Blade 1/4\" Width 6 TPI Skip Blade Style For use with 10-324, 10-325, 10-326",
    "badge": ""
  }
]